{
  "cards": [
    {
      "id": "fool",
      "name": "The Fool",
      "arcana": "major",
      "number": 0,
      "keywords": {
        "upright": [
          "new beginnings",
          "innocence",
          "spontaneity",
          "free spirit",
          "adventure"
        ],
        "reversed": [
          "recklessness",
          "risk-taking",
          "foolishness",
          "lack of direction",
          "poor judgment"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Fool represents new beginnings, having faith in the future, being inexperienced, not knowing what to expect, having beginner's luck, improvisation and believing in the universe.",
          "love": "If you're single, The Fool indicates that you're about to embark on a new romantic journey. If you're in a relationship, it suggests a fresh start or new phase.",
          "career": "A new job, career change, or business venture is on the horizon. Trust your instincts and take calculated risks.",
          "health": "Focus on preventive care and listen to your body. New health routines or treatments may be beneficial.",
          "spirituality": "You're at the beginning of a spiritual journey. Stay open to new experiences and trust your inner wisdom."
        },
        "reversed": {
          "general": "Reversed, The Fool can indicate recklessness, carelessness, or poor judgment. You may be taking unnecessary risks or acting without thinking.",
          "love": "Be cautious about rushing into relationships. Take time to really get to know someone before making commitments.",
          "career": "Avoid making impulsive career decisions. Research thoroughly before making any major changes.",
          "health": "Don't ignore warning signs or take unnecessary health risks. Seek professional advice when needed.",
          "spirituality": "You may be feeling spiritually lost or confused. Take time for reflection and seek guidance from trusted sources."
        }
      },
      "symbolism": [
        "white rose (purity)",
        "small bag (untapped knowledge)",
        "cliff edge (leap of faith)",
        "mountains (challenges ahead)",
        "sun (enlightenment)"
      ],
      "element": "air",
      "astrology": "Uranus",
      "numerology": "0 - infinite potential, the void, new beginnings",
      "description": "A young person stands at the edge of a cliff, about to step into the unknown. They carry a small bag and a white rose, symbolizing purity and new beginnings."
    },
    {
      "id": "magician",
      "name": "The Magician",
      "arcana": "major",
      "number": 1,
      "keywords": {
        "upright": [
          "manifestation",
          "resourcefulness",
          "power",
          "inspired action",
          "creativity"
        ],
        "reversed": [
          "manipulation",
          "poor planning",
          "untapped talents",
          "lack of focus",
          "deception"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Magician represents manifestation, resourcefulness, power, and inspired action. You have the tools and ability to achieve your goals.",
          "love": "You have the power to manifest the love you desire. Take action to create the relationship you want.",
          "career": "You have all the skills and resources needed to succeed. Focus your energy and take decisive action.",
          "health": "You have the power to improve your health through focused effort and positive lifestyle changes.",
          "spirituality": "You're learning to harness your spiritual power and manifest your desires through focused intention."
        },
        "reversed": {
          "general": "You may be manipulating others or being manipulated. There's a lack of focus or misuse of power and talents.",
          "love": "Beware of manipulation in relationships. Someone may not be showing their true intentions.",
          "career": "You may be lacking focus or direction in your career. Avoid shortcuts and dishonest practices.",
          "health": "You may be neglecting your health or using unhealthy methods to achieve your goals.",
          "spirituality": "You may be misusing your spiritual gifts or lacking the discipline needed for spiritual growth."
        }
      },
      "symbolism": [
        "infinity symbol (unlimited potential)",
        "four elements on table (mastery)",
        "red roses (passion)",
        "white lilies (purity)",
        "wand pointing up and down (as above, so below)"
      ],
      "element": "air",
      "astrology": "Mercury",
      "numerology": "1 - new beginnings, leadership, independence",
      "description": "A figure stands before a table with the four suits of the tarot, representing mastery over the elements. One hand points to heaven, the other to earth."
    },
    {
      "id": "high_priestess",
      "name": "The High Priestess",
      "arcana": "major",
      "number": 2,
      "keywords": {
        "upright": [
          "intuition",
          "sacred knowledge",
          "divine feminine",
          "subconscious mind",
          "inner wisdom"
        ],
        "reversed": [
          "secrets",
          "disconnected from intuition",
          "withdrawal",
          "silence",
          "repressed feelings"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The High Priestess represents intuition, sacred knowledge, and the divine feminine. Trust your inner wisdom and subconscious mind.",
          "love": "Listen to your intuition about relationships. There may be hidden aspects that need to be revealed.",
          "career": "Trust your instincts in professional matters. Knowledge and wisdom will guide you to success.",
          "health": "Pay attention to your body's subtle signals. Alternative healing methods may be beneficial.",
          "spirituality": "You're developing a deeper connection to your spiritual self. Meditation and introspection are favored."
        },
        "reversed": {
          "general": "You may be disconnected from your intuition or keeping secrets. There's a need to look within.",
          "love": "Hidden information in relationships may be causing problems. Communication is needed.",
          "career": "You may be ignoring your instincts about work situations. Important information may be hidden.",
          "health": "You may be ignoring important health signals. Seek professional guidance.",
          "spirituality": "You may be spiritually blocked or avoiding inner work that needs to be done."
        }
      },
      "symbolism": [
        "veil (hidden knowledge)",
        "pomegranates (feminine fertility)",
        "crescent moon (intuition)",
        "pillars (balance)",
        "scroll (sacred knowledge)"
      ],
      "element": "water",
      "astrology": "Moon",
      "numerology": "2 - duality, balance, cooperation",
      "description": "A woman sits between two pillars, holding a scroll of sacred knowledge. Behind her is a veil decorated with pomegranates."
    },
    {
      "id": "empress",
      "name": "The Empress",
      "arcana": "major",
      "number": 3,
      "keywords": {
        "upright": [
          "femininity",
          "beauty",
          "nature",
          "nurturing",
          "abundance",
          "creativity"
        ],
        "reversed": [
          "creative block",
          "dependence on others",
          "smothering",
          "lack of growth",
          "infertility"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Empress represents femininity, beauty, nature, and abundance. A time of growth, creativity, and nurturing energy.",
          "love": "A period of harmony and growth in relationships. Fertility and new life may be indicated.",
          "career": "Creative projects flourish. Collaborative efforts and nurturing leadership styles are favored.",
          "health": "Good health and vitality. Pregnancy or improved fertility may be indicated.",
          "spirituality": "Connection with the divine feminine and natural cycles. Creativity as spiritual expression."
        },
        "reversed": {
          "general": "Creative blocks, dependence on others, or smothering behavior. Growth may be stunted.",
          "love": "Codependency or smothering in relationships. Fertility issues may be present.",
          "career": "Creative blocks or lack of progress. You may be too dependent on others for success.",
          "health": "Health issues related to reproductive system or hormonal imbalances.",
          "spirituality": "Disconnection from the divine feminine or natural rhythms."
        }
      },
      "symbolism": [
        "wheat (abundance)",
        "venus symbol (love)",
        "crown of stars (divine connection)",
        "flowing water (emotions)",
        "lush garden (fertility)"
      ],
      "element": "earth",
      "astrology": "Venus",
      "numerology": "3 - creativity, expression, growth",
      "description": "A pregnant woman sits on a throne in a lush garden, wearing a crown of stars and surrounded by symbols of abundance and fertility."
    },
    {
      "id": "emperor",
      "name": "The Emperor",
      "arcana": "major",
      "number": 4,
      "keywords": {
        "upright": [
          "authority",
          "structure",
          "control",
          "fatherhood",
          "leadership"
        ],
        "reversed": [
          "tyranny",
          "rigidity",
          "coldness",
          "domination",
          "lack of discipline"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Emperor represents authority, structure, and control. He is the father figure who provides stability and leadership through discipline and order.",
          "love": "Strong, stable relationships built on mutual respect. Traditional values and commitment are emphasized.",
          "career": "Leadership opportunities and career advancement. Success through discipline, organization, and taking charge.",
          "health": "Good health through discipline and structure. Focus on building strength and maintaining routines.",
          "spirituality": "Spiritual discipline and structured practice. Learning through traditional teachings and established methods."
        },
        "reversed": {
          "general": "Abuse of power, tyranny, or lack of discipline. There may be issues with authority figures or rigid thinking.",
          "love": "Controlling or domineering behavior in relationships. Lack of emotional expression or overly traditional views.",
          "career": "Problems with authority, lack of leadership, or being too rigid in approach. Difficulty with structure.",
          "health": "Health issues due to stress or lack of self-discipline. Need for better structure in health routines.",
          "spirituality": "Spiritual rigidity or rejection of traditional teachings. Need for balance between structure and flexibility."
        }
      },
      "symbolism": [
        "throne (authority)",
        "ram heads (Aries)",
        "red robes (passion and power)",
        "mountains (stability)",
        "ankh (life)"
      ],
      "element": "fire",
      "astrology": "Aries",
      "numerology": "4 - stability, foundation, order",
      "description": "A bearded emperor sits on a stone throne decorated with ram heads, holding an ankh scepter, representing earthly power and authority."
    },
    {
      "id": "hierophant",
      "name": "The Hierophant",
      "arcana": "major",
      "number": 5,
      "keywords": {
        "upright": [
          "tradition",
          "conformity",
          "morality",
          "ethics",
          "spiritual guidance"
        ],
        "reversed": [
          "rebellion",
          "subversiveness",
          "new approaches",
          "personal beliefs",
          "challenging tradition"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Hierophant represents tradition, conformity, and spiritual guidance. He is the bridge between the divine and earthly realms.",
          "love": "Traditional relationships and conventional approaches to love. Marriage and commitment are favored.",
          "career": "Success through following established procedures and traditional methods. Mentorship and guidance from experienced colleagues.",
          "health": "Traditional healing methods and conventional medicine. Following established health protocols.",
          "spirituality": "Learning from established spiritual traditions and seeking guidance from spiritual teachers or institutions."
        },
        "reversed": {
          "general": "Rebellion against tradition, challenging established norms, or seeking alternative approaches to spirituality and life.",
          "love": "Unconventional relationships or challenging traditional relationship norms. Freedom from societal expectations.",
          "career": "Innovation and new approaches to work. Challenging established procedures or seeking alternative career paths.",
          "health": "Alternative healing methods and non-traditional approaches to health and wellness.",
          "spirituality": "Personal spiritual path that diverges from traditional teachings. Seeking your own truth and spiritual understanding."
        }
      },
      "symbolism": [
        "papal cross (spiritual authority)",
        "two pillars (duality)",
        "keys (knowledge)",
        "two acolytes (teaching)",
        "religious vestments (tradition)"
      ],
      "element": "earth",
      "astrology": "Taurus",
      "numerology": "5 - change, freedom, adventure",
      "description": "A religious figure sits between two pillars, holding a papal cross, with two acolytes kneeling before him, representing spiritual authority and tradition."
    },
    {
      "id": "lovers",
      "name": "The Lovers",
      "arcana": "major",
      "number": 6,
      "keywords": {
        "upright": [
          "partnerships",
          "duality",
          "union",
          "choices",
          "harmony"
        ],
        "reversed": [
          "loss of balance",
          "one-sidedness",
          "disharmony",
          "misalignment",
          "poor choices"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Lovers represents partnerships, choices, and the union of opposites. It's about harmony, love, and important decisions.",
          "love": "Deep, meaningful relationships and soul connections. True love and partnership based on mutual understanding.",
          "career": "Collaborative partnerships and team harmony. Important career decisions that align with your values.",
          "health": "Balance and harmony in health matters. The importance of mental and emotional well-being alongside physical health.",
          "spirituality": "Union of conscious and unconscious, integration of opposing forces within yourself."
        },
        "reversed": {
          "general": "Disharmony, poor choices, or imbalance in relationships. Difficulty in making important decisions.",
          "love": "Relationship problems, lack of harmony, or choosing the wrong partner. Communication issues.",
          "career": "Poor business partnerships or conflicts with colleagues. Misaligned career choices.",
          "health": "Imbalance affecting health. Need to address both physical and emotional aspects of well-being.",
          "spirituality": "Internal conflict or disconnection from your higher self. Difficulty integrating different aspects of your personality."
        }
      },
      "symbolism": [
        "angel (divine blessing)",
        "man and woman (duality)",
        "tree of knowledge (choice)",
        "tree of life (growth)",
        "mountain (challenges)"
      ],
      "element": "air",
      "astrology": "Gemini",
      "numerology": "6 - harmony, balance, responsibility",
      "description": "A man and woman stand beneath an angel, representing the choice between earthly desires and spiritual growth, with trees symbolizing knowledge and life."
    },
    {
      "id": "chariot",
      "name": "The Chariot",
      "arcana": "major",
      "number": 7,
      "keywords": {
        "upright": [
          "direction",
          "control",
          "willpower",
          "determination",
          "victory"
        ],
        "reversed": [
          "lack of control",
          "lack of direction",
          "aggression",
          "scattered energy",
          "defeat"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Chariot represents determination, willpower, and victory through focused effort. You have the strength to overcome obstacles.",
          "love": "Taking control of your love life and moving forward with determination. Overcoming relationship obstacles.",
          "career": "Career advancement through determination and focused effort. Victory in professional endeavors.",
          "health": "Overcoming health challenges through willpower and determination. Taking control of your health.",
          "spirituality": "Spiritual progress through disciplined practice and focused intention. Mastering inner conflicts."
        },
        "reversed": {
          "general": "Lack of direction, scattered energy, or loss of control. Aggression or forcing situations that require patience.",
          "love": "Relationship conflicts due to stubbornness or lack of direction. Need for better communication and compromise.",
          "career": "Lack of focus in career goals or aggressive behavior in professional settings. Scattered efforts.",
          "health": "Health issues due to stress or lack of self-control. Need for better balance and direction.",
          "spirituality": "Spiritual confusion or forcing spiritual growth instead of allowing natural progression."
        }
      },
      "symbolism": [
        "two sphinxes (opposing forces)",
        "star crown (divine guidance)",
        "city behind (civilization)",
        "armor (protection)",
        "wand (authority)"
      ],
      "element": "water",
      "astrology": "Cancer",
      "numerology": "7 - spiritual awakening, inner wisdom",
      "description": "A warrior sits in a chariot pulled by two sphinxes, one black and one white, representing the mastery of opposing forces through willpower."
    },
    {
      "id": "strength",
      "name": "Strength",
      "arcana": "major",
      "number": 8,
      "keywords": {
        "upright": [
          "inner strength",
          "bravery",
          "compassion",
          "focus",
          "gentle control"
        ],
        "reversed": [
          "self doubt",
          "weakness",
          "insecurity",
          "lack of confidence",
          "abuse of power"
        ]
      },
      "meanings": {
        "upright": {
          "general": "Strength represents inner strength, courage, and the power of gentle persuasion over brute force. True strength comes from within.",
          "love": "Patience and compassion in relationships. Gentle strength that nurtures and supports your partner.",
          "career": "Success through patience, persistence, and inner strength rather than aggressive tactics.",
          "health": "Inner strength supporting physical healing. The power of positive thinking and emotional resilience.",
          "spirituality": "Mastering your inner nature through compassion and understanding rather than force."
        },
        "reversed": {
          "general": "Self-doubt, lack of confidence, or misuse of power. Inner turmoil and inability to control impulses.",
          "love": "Insecurity in relationships or using emotional manipulation. Lack of self-confidence affecting partnerships.",
          "career": "Lack of confidence in professional abilities or abuse of power in workplace situations.",
          "health": "Health issues related to stress, anxiety, or lack of emotional strength. Need for inner healing.",
          "spirituality": "Spiritual weakness or inability to control negative impulses. Need for inner work and self-compassion."
        }
      },
      "symbolism": [
        "woman and lion (gentle strength)",
        "infinity symbol (eternal power)",
        "white robes (purity)",
        "flowers (gentleness)",
        "mountains (challenges overcome)"
      ],
      "element": "fire",
      "astrology": "Leo",
      "numerology": "8 - material mastery, inner strength",
      "description": "A woman gently closes the mouth of a lion, demonstrating that true strength comes from inner courage and compassion rather than force."
    },
    {
      "id": "hermit",
      "name": "The Hermit",
      "arcana": "major",
      "number": 9,
      "keywords": {
        "upright": [
          "contemplation",
          "search for truth",
          "inner guidance",
          "solitude",
          "wisdom"
        ],
        "reversed": [
          "loneliness",
          "isolation",
          "lost your way",
          "stubbornness",
          "paranoia"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Hermit represents introspection, seeking inner wisdom, and the search for truth. A time for solitude and self-reflection.",
          "love": "Taking time for self-reflection in relationships. Understanding your own needs before committing to others.",
          "career": "Seeking guidance and wisdom in career matters. Taking time to reflect on your professional path.",
          "health": "Looking inward for healing and understanding the root causes of health issues. Meditation and introspection.",
          "spirituality": "Deep spiritual seeking and inner journey. Finding wisdom through solitude and contemplation."
        },
        "reversed": {
          "general": "Isolation, loneliness, or being lost. Stubbornness or refusing guidance from others.",
          "love": "Loneliness or isolation in relationships. Difficulty opening up to others or fear of intimacy.",
          "career": "Professional isolation or refusing help and guidance. Being too withdrawn in work situations.",
          "health": "Mental health issues related to isolation or depression. Need for social connection and support.",
          "spirituality": "Spiritual isolation or stubbornly refusing to consider other perspectives. Lost on your spiritual path."
        }
      },
      "symbolism": [
        "lantern (inner light)",
        "staff (support)",
        "mountain peak (spiritual heights)",
        "star in lantern (guidance)",
        "grey robes (wisdom)"
      ],
      "element": "earth",
      "astrology": "Virgo",
      "numerology": "9 - completion, wisdom, spiritual awareness",
      "description": "An old man stands alone on a mountain peak, holding a lantern containing a six-pointed star, representing the search for inner truth and wisdom."
    },
    {
      "id": "ace_of_wands",
      "name": "Ace of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 1,
      "keywords": {
        "upright": [
          "inspiration",
          "new opportunities",
          "growth",
          "potential",
          "creative spark"
        ],
        "reversed": [
          "lack of energy",
          "delays",
          "creative blocks",
          "missed opportunities",
          "lack of direction"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ace of Wands represents inspiration, new opportunities, and growth. A creative spark or new venture is beginning.",
          "love": "A new romantic opportunity or passionate phase in your current relationship is emerging.",
          "career": "A new job opportunity, promotion, or creative project is on the horizon. Act on your inspiration.",
          "health": "Renewed energy and vitality. A good time to start new health routines or treatments.",
          "spirituality": "A spiritual awakening or new understanding is emerging. Follow your inner fire."
        },
        "reversed": {
          "general": "You may be experiencing creative blocks, delays, or lack of direction. Energy is scattered or misdirected.",
          "love": "Passion may be lacking in your relationship, or you're missing romantic opportunities.",
          "career": "Career progress may be delayed. You may lack motivation or direction in your professional life.",
          "health": "Low energy or health setbacks. You may need to rest and recharge before moving forward.",
          "spirituality": "Spiritual growth may be stagnant. You may be disconnected from your inner fire and passion."
        }
      },
      "symbolism": [
        "wand sprouting leaves (new growth)",
        "hand from cloud (divine inspiration)",
        "castle (achievement)",
        "mountains (challenges)",
        "fertile landscape (potential)"
      ],
      "element": "fire",
      "astrology": "Fire signs (Aries, Leo, Sagittarius)",
      "numerology": "1 - new beginnings, potential, unity",
      "description": "A hand emerges from a cloud, grasping a wand that sprouts with new leaves, symbolizing new creative potential and opportunities."
    },
    {
      "id": "two_of_wands",
      "name": "Two of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 2,
      "keywords": {
        "upright": [
          "planning",
          "making decisions",
          "leaving comfort zone",
          "personal power",
          "future planning"
        ],
        "reversed": [
          "lack of planning",
          "disorganized",
          "playing it safe",
          "bad planning",
          "over-analysis"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Two of Wands represents planning, making decisions, and stepping out of your comfort zone. You're considering your options and planning for the future.",
          "love": "You're considering your options in love. If single, you may be weighing potential partners. In relationships, you're planning your future together.",
          "career": "Career planning and considering new opportunities. You have the power to shape your professional future.",
          "health": "Planning for better health outcomes. Consider preventive measures and long-term health strategies.",
          "spirituality": "Spiritual planning and considering different paths. You're expanding your spiritual horizons."
        },
        "reversed": {
          "general": "Poor planning, disorganization, or fear of leaving your comfort zone. You may be over-analyzing instead of taking action.",
          "love": "Indecision in relationships or fear of commitment. You may be playing it too safe in love.",
          "career": "Lack of career planning or fear of taking professional risks. Poor decision-making in work matters.",
          "health": "Neglecting health planning or making poor health decisions. Lack of long-term health strategy.",
          "spirituality": "Spiritual stagnation or fear of exploring new spiritual paths."
        }
      },
      "symbolism": [
        "globe (world of possibilities)",
        "wands (power and potential)",
        "castle (security)",
        "mountains (challenges ahead)",
        "red cap (passion)"
      ],
      "element": "fire",
      "astrology": "Mars in Aries",
      "numerology": "2 - balance, cooperation, choices",
      "description": "A figure holds a globe while looking out from a castle, contemplating future possibilities and planning the next move."
    },
    {
      "id": "three_of_wands",
      "name": "Three of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 3,
      "keywords": {
        "upright": [
          "looking ahead",
          "expansion",
          "rapid growth",
          "foresight",
          "overseas opportunities"
        ],
        "reversed": [
          "obstacles",
          "delays",
          "frustration",
          "lack of foresight",
          "failed expansion"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Three of Wands represents expansion, foresight, and looking ahead to future opportunities. Your plans are beginning to bear fruit.",
          "love": "Expanding your horizons in love, possibly through long-distance relationships or meeting someone from a different background.",
          "career": "Career expansion and growth opportunities. International business or expanding your professional network.",
          "health": "Expanding your health and wellness routine. Exploring new approaches to fitness and well-being.",
          "spirituality": "Expanding your spiritual horizons and exploring new spiritual practices or teachings."
        },
        "reversed": {
          "general": "Delays in plans, obstacles to expansion, or lack of foresight. Frustration with slow progress.",
          "love": "Obstacles in long-distance relationships or delays in relationship progress. Lack of vision for the future together.",
          "career": "Career expansion plans facing obstacles or delays. Lack of foresight in professional planning.",
          "health": "Delays in health improvement or obstacles to wellness goals. Need for better planning.",
          "spirituality": "Obstacles to spiritual growth or lack of vision for your spiritual path."
        }
      },
      "symbolism": [
        "three wands (established foundation)",
        "ships (exploration)",
        "distant mountains (future challenges)",
        "figure looking ahead (foresight)",
        "established position (success)"
      ],
      "element": "fire",
      "astrology": "Sun in Aries",
      "numerology": "3 - creativity, expansion, growth",
      "description": "A figure stands with three wands, looking out over water at ships in the distance, representing foresight and expansion of horizons."
    },
    {
      "id": "four_of_wands",
      "name": "Four of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 4,
      "keywords": {
        "upright": [
          "community",
          "home",
          "celebration",
          "harmony",
          "milestone"
        ],
        "reversed": [
          "lack of support",
          "transience",
          "home conflicts",
          "delayed celebration",
          "instability"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Four of Wands represents celebration, harmony, and reaching a milestone. A time of joy and community support.",
          "love": "Celebrating relationship milestones, engagement, marriage, or moving in together. Harmony and stability in love.",
          "career": "Celebrating professional achievements and milestones. Team harmony and workplace celebrations.",
          "health": "Celebrating health improvements and reaching wellness goals. Support from family and friends.",
          "spirituality": "Spiritual celebrations and community support. Reaching important spiritual milestones."
        },
        "reversed": {
          "general": "Lack of support, instability, or delayed celebrations. Conflicts within your community or family.",
          "love": "Relationship instability or lack of support from family and friends. Delayed celebrations or milestones.",
          "career": "Workplace conflicts or lack of team support. Delayed recognition of achievements.",
          "health": "Lack of support for health goals or family conflicts affecting well-being.",
          "spirituality": "Lack of spiritual community support or conflicts within spiritual groups."
        }
      },
      "symbolism": [
        "four wands (stability)",
        "garland (celebration)",
        "castle (security)",
        "people celebrating (community)",
        "flowers (joy)"
      ],
      "element": "fire",
      "astrology": "Venus in Aries",
      "numerology": "4 - stability, foundation, completion",
      "description": "Four wands support a garland of flowers, with people celebrating beneath, representing harmony, celebration, and community support."
    },
    {
      "id": "five_of_wands",
      "name": "Five of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 5,
      "keywords": {
        "upright": [
          "competition",
          "rivalry",
          "conflict",
          "disagreement",
          "struggle"
        ],
        "reversed": [
          "avoiding conflict",
          "respecting differences",
          "inner conflict",
          "cooperation",
          "resolution"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Five of Wands represents competition, conflict, and struggle. Multiple forces are at play, creating tension and rivalry.",
          "love": "Relationship conflicts, competition for someone's attention, or disagreements with your partner.",
          "career": "Workplace competition, conflicts with colleagues, or struggling against opposition in professional matters.",
          "health": "Health challenges requiring effort and struggle. Competition or conflict affecting your well-being.",
          "spirituality": "Spiritual conflicts or struggling with different belief systems. Inner turmoil and confusion."
        },
        "reversed": {
          "general": "Avoiding conflict, finding resolution, or learning to work together despite differences.",
          "love": "Resolving relationship conflicts or learning to respect differences. Avoiding unnecessary arguments.",
          "career": "Finding ways to cooperate despite workplace competition. Resolving professional conflicts.",
          "health": "Overcoming health struggles or finding ways to work with your body rather than against it.",
          "spirituality": "Resolving spiritual conflicts or finding peace with different belief systems."
        }
      },
      "symbolism": [
        "five figures (conflict)",
        "wands crossing (opposition)",
        "different colored clothes (diversity)",
        "struggle (competition)",
        "no clear winner (ongoing conflict)"
      ],
      "element": "fire",
      "astrology": "Saturn in Leo",
      "numerology": "5 - conflict, change, instability",
      "description": "Five figures hold wands in what appears to be a struggle or competition, with their wands crossing and conflicting, representing rivalry and discord."
    },
    {
      "id": "ace_of_cups",
      "name": "Ace of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 1,
      "keywords": {
        "upright": [
          "new relationships",
          "compassion",
          "creativity",
          "love",
          "emotional awakening"
        ],
        "reversed": [
          "emotional loss",
          "blocked creativity",
          "emptiness",
          "lack of love",
          "emotional instability"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ace of Cups represents new emotional beginnings, love, and spiritual awakening. Your heart is open to new experiences.",
          "love": "New love is entering your life, or existing relationships are deepening. Emotional fulfillment and joy.",
          "career": "Creative opportunities and emotionally fulfilling work. Collaboration and positive relationships with colleagues.",
          "health": "Emotional healing and improved mental health. Focus on activities that bring you joy.",
          "spirituality": "Spiritual awakening and connection to divine love. Your intuition is heightened."
        },
        "reversed": {
          "general": "Emotional blocks, emptiness, or loss. You may be struggling with self-love or feeling disconnected from others.",
          "love": "Relationship problems, unrequited love, or emotional unavailability. Difficulty expressing feelings.",
          "career": "Lack of creativity or emotional fulfillment in work. Difficult relationships with colleagues.",
          "health": "Emotional or mental health challenges. Depression or anxiety may be present.",
          "spirituality": "Spiritual emptiness or disconnection from your intuitive side."
        }
      },
      "symbolism": [
        "overflowing cup (abundance of emotion)",
        "dove (peace and love)",
        "hand from cloud (divine gift)",
        "lotus (spiritual awakening)",
        "water (emotions)"
      ],
      "element": "water",
      "astrology": "Water signs (Cancer, Scorpio, Pisces)",
      "numerology": "1 - new beginnings, potential, unity",
      "description": "A hand emerges from a cloud, offering a cup that overflows with water, symbolizing emotional and spiritual abundance."
    },
    {
      "id": "two_of_cups",
      "name": "Two of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 2,
      "keywords": {
        "upright": [
          "unity",
          "partnership",
          "connection",
          "attraction",
          "mutual respect"
        ],
        "reversed": [
          "imbalance",
          "broken communication",
          "tension",
          "separation",
          "misalignment"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Two of Cups represents partnership, mutual attraction, and the beginning of a significant relationship. A harmonious union of energies.",
          "love": "New romantic relationships or deepening existing ones. Mutual attraction, harmony, and emotional connection.",
          "career": "Positive business partnerships or collaborations. Good relationships with colleagues and mutual respect.",
          "health": "Balance between mind and body. Emotional well-being supporting physical health.",
          "spirituality": "Union of masculine and feminine energies. Spiritual partnerships or finding balance within yourself."
        },
        "reversed": {
          "general": "Imbalance in relationships, miscommunication, or tension between partners. Disharmony or separation.",
          "love": "Relationship imbalances, communication problems, or one-sided feelings. Need for better understanding.",
          "career": "Difficult business partnerships or workplace tensions. Imbalance in professional relationships.",
          "health": "Imbalance affecting health. Need to address both physical and emotional aspects of well-being.",
          "spirituality": "Spiritual imbalance or disconnection from your inner self. Need for integration of opposing forces."
        }
      },
      "symbolism": [
        "two cups (partnership)",
        "caduceus (healing)",
        "lion (passion)",
        "winged figure (divine blessing)",
        "exchange (reciprocity)"
      ],
      "element": "water",
      "astrology": "Venus in Cancer",
      "numerology": "2 - duality, partnership, cooperation",
      "description": "A man and woman exchange cups in a ceremony of union, with a caduceus symbol between them, representing partnership and mutual exchange."
    },
    {
      "id": "three_of_cups",
      "name": "Three of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 3,
      "keywords": {
        "upright": [
          "friendship",
          "community",
          "happiness",
          "celebration",
          "collaboration"
        ],
        "reversed": [
          "overindulgence",
          "gossip",
          "isolation",
          "exclusion",
          "superficial relationships"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Three of Cups represents celebration, friendship, and community. A time of joy, creativity, and social connection.",
          "love": "Joyful relationships and social harmony. Celebrating love with friends and community.",
          "career": "Collaborative work environments and team success. Celebrating professional achievements with colleagues.",
          "health": "Improved health through social support and joyful activities. The healing power of friendship.",
          "spirituality": "Spiritual community and shared practices. Finding joy and connection in spiritual pursuits."
        },
        "reversed": {
          "general": "Overindulgence, superficial relationships, or social isolation. Gossip or exclusion from groups.",
          "love": "Relationship issues due to interference from others. Gossip affecting your partnership or feeling excluded.",
          "career": "Workplace gossip, exclusion from teams, or superficial professional relationships.",
          "health": "Health issues from overindulgence or lack of social support. Need for moderation.",
          "spirituality": "Spiritual isolation or superficial spiritual communities. Need for deeper connections."
        }
      },
      "symbolism": [
        "three women (friendship)",
        "raised cups (celebration)",
        "dancing (joy)",
        "harvest (abundance)",
        "circle (community)"
      ],
      "element": "water",
      "astrology": "Mercury in Cancer",
      "numerology": "3 - creativity, expression, joy",
      "description": "Three women dance in a circle, raising cups in celebration, representing friendship, community support, and joyful gatherings."
    },
    {
      "id": "ace_of_swords",
      "name": "Ace of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 1,
      "keywords": {
        "upright": [
          "breakthrough",
          "clarity",
          "sharp mind",
          "new ideas",
          "mental clarity"
        ],
        "reversed": [
          "confusion",
          "brutality",
          "chaos",
          "lack of clarity",
          "mental blocks"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ace of Swords represents mental clarity, breakthrough moments, and new ideas. A time of intellectual awakening and clear thinking.",
          "love": "Clear communication in relationships and honest conversations. Mental connection with your partner.",
          "career": "New ideas and intellectual breakthroughs in your career. Clear thinking leading to professional success.",
          "health": "Mental clarity supporting overall health. Clear understanding of health issues and solutions.",
          "spirituality": "Spiritual clarity and breakthrough insights. Clear understanding of your spiritual path."
        },
        "reversed": {
          "general": "Mental confusion, lack of clarity, or misuse of intellectual power. Chaotic thinking or brutal honesty.",
          "love": "Miscommunication in relationships or harsh words causing damage. Lack of mental connection.",
          "career": "Confused thinking affecting work performance. Misuse of intellectual abilities or harsh communication.",
          "health": "Mental health challenges or confusion about health matters. Need for clearer thinking.",
          "spirituality": "Spiritual confusion or misuse of spiritual knowledge. Lack of clarity on your path."
        }
      },
      "symbolism": [
        "single sword (mental power)",
        "crown (victory)",
        "hand from cloud (divine inspiration)",
        "mountains (challenges)",
        "olive branch (peace)"
      ],
      "element": "air",
      "astrology": "Air signs (Gemini, Libra, Aquarius)",
      "numerology": "1 - new beginnings, potential, unity",
      "description": "A hand emerges from a cloud, grasping a sword crowned with a wreath, representing mental clarity and the power of clear thinking."
    },
    {
      "id": "three_of_swords",
      "name": "Three of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 3,
      "keywords": {
        "upright": [
          "heartbreak",
          "suffering",
          "grief",
          "sorrow",
          "emotional pain"
        ],
        "reversed": [
          "recovery",
          "forgiveness",
          "moving on",
          "healing",
          "acceptance"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Three of Swords represents heartbreak, emotional pain, and grief. A time of sorrow that ultimately leads to healing and growth.",
          "love": "Heartbreak, betrayal, or separation in relationships. Emotional pain from love lost or unrequited.",
          "career": "Disappointment or betrayal in professional matters. Emotional stress affecting work performance.",
          "health": "Emotional stress affecting physical health. Grief or sorrow impacting overall well-being.",
          "spirituality": "Spiritual crisis or loss of faith. Emotional pain leading to spiritual growth and understanding."
        },
        "reversed": {
          "general": "Recovery from heartbreak, forgiveness, and moving forward. Healing from emotional pain and finding peace.",
          "love": "Healing from relationship wounds and learning to love again. Forgiveness and emotional recovery.",
          "career": "Recovery from professional disappointments and moving forward with renewed purpose.",
          "health": "Emotional healing supporting physical recovery. Overcoming grief and finding peace.",
          "spirituality": "Spiritual healing and renewed faith. Finding meaning in suffering and growing stronger."
        }
      },
      "symbolism": [
        "three swords (pain)",
        "pierced heart (emotional wound)",
        "storm clouds (turmoil)",
        "rain (tears)",
        "grey sky (sadness)"
      ],
      "element": "air",
      "astrology": "Saturn in Libra",
      "numerology": "3 - creativity, expression, growth through pain",
      "description": "Three swords pierce a red heart beneath storm clouds, representing the pain of heartbreak and emotional suffering."
    },
    {
      "id": "ace_of_pentacles",
      "name": "Ace of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 1,
      "keywords": {
        "upright": [
          "opportunity",
          "prosperity",
          "new venture",
          "manifestation",
          "material success"
        ],
        "reversed": [
          "lost opportunity",
          "missed chance",
          "bad investment",
          "lack of planning",
          "greed"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ace of Pentacles represents new opportunities for material success, prosperity, and manifestation. A chance to build something lasting.",
          "love": "Stable, grounded relationships with potential for long-term commitment. Material security in partnerships.",
          "career": "New job opportunities, business ventures, or financial prospects. The foundation for material success.",
          "health": "Good physical health and vitality. New approaches to health and wellness that show tangible results.",
          "spirituality": "Grounding spiritual insights into practical reality. Manifesting spiritual growth in the material world."
        },
        "reversed": {
          "general": "Missed opportunities, poor planning, or greed affecting your material prospects. Lack of practical foundation.",
          "love": "Relationships lacking stability or material security. Greed or materialism affecting partnerships.",
          "career": "Missed career opportunities or poor financial planning. Lack of practical foundation for success.",
          "health": "Poor health habits or neglecting physical well-being. Lack of practical approach to health.",
          "spirituality": "Difficulty grounding spiritual insights into practical reality. Materialism blocking spiritual growth."
        }
      },
      "symbolism": [
        "single pentacle (material opportunity)",
        "hand from cloud (divine gift)",
        "garden (growth)",
        "path (journey)",
        "mountains (challenges)"
      ],
      "element": "earth",
      "astrology": "Earth signs (Taurus, Virgo, Capricorn)",
      "numerology": "1 - new beginnings, potential, unity",
      "description": "A hand emerges from a cloud, offering a golden pentacle above a lush garden, representing new opportunities for material prosperity."
    },
    {
      "id": "wheel_of_fortune",
      "name": "Wheel of Fortune",
      "arcana": "major",
      "number": 10,
      "keywords": {
        "upright": [
          "change",
          "cycles",
          "inevitable fate",
          "good luck",
          "karma"
        ],
        "reversed": [
          "no control",
          "clinging to control",
          "bad luck",
          "lack of direction",
          "unwelcome changes"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Wheel of Fortune represents change, cycles, and the inevitable nature of fate. What goes up must come down, and vice versa. A time of good luck and positive change.",
          "love": "Positive changes in your love life are coming. If single, you may meet someone special. In relationships, expect a positive turn of events.",
          "career": "Career changes and new opportunities are on the horizon. Your hard work is about to pay off with a stroke of good fortune.",
          "health": "A positive turn in health matters. Recovery and improvement are indicated. Trust in the natural healing process.",
          "spirituality": "You're entering a new spiritual cycle. Trust in the universe's plan and embrace the changes coming your way."
        },
        "reversed": {
          "general": "Resistance to change, bad luck, or feeling like you have no control over your circumstances. You may be trying to force outcomes.",
          "love": "Relationship setbacks or unwelcome changes. You may be trying to control your partner or resist natural relationship evolution.",
          "career": "Career setbacks or missed opportunities. You may be resisting necessary changes or trying to control outcomes beyond your influence.",
          "health": "Health challenges or setbacks. You may be resisting necessary lifestyle changes or treatments.",
          "spirituality": "Spiritual stagnation or resistance to growth. You may be fighting against your spiritual evolution or destiny."
        }
      },
      "symbolism": [
        "wheel (cycles of life)",
        "sphinx (wisdom)",
        "snake (knowledge)",
        "anubis (death and rebirth)",
        "four creatures (fixed signs)",
        "hebrew letters (divine name)"
      ],
      "element": "fire",
      "astrology": "Jupiter",
      "numerology": "10 - completion, fulfillment, new cycle beginning",
      "description": "A large wheel dominates the card, with various mystical creatures and symbols around it, representing the eternal cycles of life, death, and rebirth."
    },
    {
      "id": "justice",
      "name": "Justice",
      "arcana": "major",
      "number": 11,
      "keywords": {
        "upright": [
          "cause and effect",
          "clarity",
          "truth",
          "fairness",
          "accountability"
        ],
        "reversed": [
          "dishonesty",
          "unaccountability",
          "unfairness",
          "bias",
          "lack of accountability"
        ]
      },
      "meanings": {
        "upright": {
          "general": "Justice represents fairness, truth, and the law of cause and effect. You will be held accountable for your actions, and truth will prevail.",
          "love": "Fairness and balance in relationships. If you've been honest and fair, you'll be rewarded. Truth in relationships is essential.",
          "career": "Fair treatment at work and just rewards for your efforts. Legal matters will be resolved fairly. Ethical behavior is important.",
          "health": "Balance and moderation in health matters. The consequences of past health choices are manifesting. Seek fair and balanced treatment.",
          "spirituality": "Spiritual justice and karma. You're learning about the universal law of cause and effect. Truth and integrity guide your path."
        },
        "reversed": {
          "general": "Injustice, dishonesty, or avoiding accountability. You may be experiencing unfair treatment or acting unethically yourself.",
          "love": "Unfairness or dishonesty in relationships. Someone may be avoiding responsibility or acting with bias.",
          "career": "Workplace injustice or unethical behavior. You may be experiencing discrimination or acting dishonestly yourself.",
          "health": "Ignoring the consequences of poor health choices or receiving inadequate medical care.",
          "spirituality": "Spiritual imbalance or avoiding karmic lessons. You may be acting against your moral compass."
        }
      },
      "symbolism": [
        "scales (balance and fairness)",
        "sword (truth and clarity)",
        "blindfold (impartiality)",
        "pillars (law and order)",
        "red robes (passion for justice)"
      ],
      "element": "air",
      "astrology": "Libra",
      "numerology": "11 - master number, spiritual insight, justice",
      "description": "A figure sits on a throne holding scales in one hand and a sword in the other, representing the balance of justice and the power of truth."
    },
    {
      "id": "hanged_man",
      "name": "The Hanged Man",
      "arcana": "major",
      "number": 12,
      "keywords": {
        "upright": [
          "sacrifice",
          "release",
          "martyrdom",
          "suspension",
          "letting go"
        ],
        "reversed": [
          "stalling",
          "needless sacrifice",
          "fear of sacrifice",
          "resistance",
          "martyrdom complex"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Hanged Man represents willing sacrifice, suspension, and seeing things from a new perspective. Sometimes you must let go to move forward.",
          "love": "A period of waiting or sacrifice in relationships. You may need to let go of control or make sacrifices for love.",
          "career": "Career delays or the need to sacrifice something for long-term gain. A different perspective on your professional path is needed.",
          "health": "A period of rest and healing. You may need to sacrifice certain habits or activities for better health.",
          "spirituality": "Spiritual surrender and letting go of ego. You're learning to trust in divine timing and higher wisdom."
        },
        "reversed": {
          "general": "Resistance to necessary sacrifice, stalling, or making needless sacrifices. You may be avoiding important decisions.",
          "love": "Avoiding necessary relationship sacrifices or making unnecessary ones. Fear of commitment or change.",
          "career": "Avoiding necessary career changes or making pointless sacrifices. Resistance to new perspectives.",
          "health": "Resistance to necessary health changes or making ineffective sacrifices. Avoiding needed rest or treatment.",
          "spirituality": "Spiritual resistance or martyrdom complex. Avoiding necessary spiritual growth or making meaningless sacrifices."
        }
      },
      "symbolism": [
        "upside down figure (new perspective)",
        "halo (enlightenment)",
        "tree (growth and sacrifice)",
        "rope (binding and release)",
        "serene expression (acceptance)"
      ],
      "element": "water",
      "astrology": "Neptune",
      "numerology": "12 - completion of cycle, spiritual sacrifice",
      "description": "A figure hangs upside down from a tree by one foot, with a serene expression and a halo around their head, representing willing sacrifice and enlightenment."
    },
    {
      "id": "death",
      "name": "Death",
      "arcana": "major",
      "number": 13,
      "keywords": {
        "upright": [
          "end of cycle",
          "beginnings",
          "change",
          "metamorphosis",
          "transformation"
        ],
        "reversed": [
          "fear of change",
          "holding on",
          "stagnation",
          "decay",
          "resistance to change"
        ]
      },
      "meanings": {
        "upright": {
          "general": "Death represents transformation, the end of one phase and the beginning of another. This is rarely about physical death, but rather spiritual rebirth and renewal.",
          "love": "The end of one relationship phase and the beginning of another. If single, you're ready for a new type of love. In relationships, expect major positive changes.",
          "career": "A career transformation is occurring. Old ways of working are ending, making way for new opportunities and growth.",
          "health": "A period of healing and renewal. Old health issues may resolve, and you may adopt new, healthier lifestyle patterns.",
          "spirituality": "Spiritual transformation and rebirth. You're shedding old beliefs and embracing a new spiritual understanding."
        },
        "reversed": {
          "general": "Resistance to necessary change, fear of transformation, or stagnation. You may be clinging to what no longer serves you.",
          "love": "Fear of relationship changes or refusing to let go of past relationships. Resistance to growth in love.",
          "career": "Resistance to necessary career changes or fear of professional transformation. Clinging to outdated methods.",
          "health": "Resistance to necessary health changes or fear of new treatments. Avoiding needed lifestyle transformations.",
          "spirituality": "Spiritual stagnation or fear of spiritual growth. Clinging to outdated beliefs that no longer serve you."
        }
      },
      "symbolism": [
        "skeleton (death and rebirth)",
        "black armor (protection during transformation)",
        "white rose (purity and new life)",
        "rising sun (new beginnings)",
        "flowing river (life continues)"
      ],
      "element": "water",
      "astrology": "Scorpio",
      "numerology": "13 - transformation, death and rebirth",
      "description": "A skeleton in black armor rides a white horse, carrying a black flag with a white rose. The sun rises in the background, symbolizing rebirth after transformation."
    },
    {
      "id": "temperance",
      "name": "Temperance",
      "arcana": "major",
      "number": 14,
      "keywords": {
        "upright": [
          "middle path",
          "patience",
          "finding meaning",
          "balance",
          "moderation"
        ],
        "reversed": [
          "extremes",
          "excess",
          "lack of balance",
          "impatience",
          "discord"
        ]
      },
      "meanings": {
        "upright": {
          "general": "Temperance represents balance, moderation, and patience. It's about finding the middle path and blending opposing forces harmoniously.",
          "love": "Balance and harmony in relationships. Take time to understand your partner's perspective and find middle ground in disagreements.",
          "career": "Success through patience and balanced approach. Avoid extremes and work steadily toward your goals.",
          "health": "Good health through moderation and balance. Avoid extremes in diet, exercise, or lifestyle choices.",
          "spirituality": "Spiritual balance and integration. You're learning to blend different aspects of your spiritual practice harmoniously."
        },
        "reversed": {
          "general": "Imbalance, extremes, or lack of moderation. You may be going to extremes or struggling to find harmony.",
          "love": "Relationship imbalances or extremes. One partner may be giving too much while the other takes too much.",
          "career": "Work-life imbalance or extreme approaches to career goals. Burnout or lack of progress due to impatience.",
          "health": "Health issues due to extremes or lack of moderation. Overindulgence or excessive restriction.",
          "spirituality": "Spiritual imbalance or extremism. You may be too rigid or too permissive in your spiritual practice."
        }
      },
      "symbolism": [
        "angel (divine guidance)",
        "water flowing between cups (balance)",
        "one foot on land, one in water (balance of elements)",
        "triangle in square (spirit in matter)",
        "iris flowers (message from divine)"
      ],
      "element": "fire",
      "astrology": "Sagittarius",
      "numerology": "14 - temperance, balance, spiritual alchemy",
      "description": "An angel stands with one foot on land and one in water, pouring water between two cups, representing the perfect balance of opposing forces."
    },
    {
      "id": "devil",
      "name": "The Devil",
      "arcana": "major",
      "number": 15,
      "keywords": {
        "upright": [
          "addiction",
          "materialism",
          "playfulness",
          "bondage",
          "temptation"
        ],
        "reversed": [
          "freedom",
          "release",
          "restoring control",
          "breaking chains",
          "enlightenment"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Devil represents bondage, addiction, and being trapped by material desires. It's about recognizing what enslaves you and choosing freedom.",
          "love": "Unhealthy relationship patterns, codependency, or sexual obsession. You may feel trapped in a toxic relationship dynamic.",
          "career": "Being trapped in an unfulfilling job or unhealthy work patterns. Materialism may be driving your career choices.",
          "health": "Addiction or unhealthy habits affecting your wellbeing. You may feel powerless to change destructive patterns.",
          "spirituality": "Spiritual bondage or being trapped by limiting beliefs. You may be avoiding your spiritual growth."
        },
        "reversed": {
          "general": "Breaking free from addiction, toxic patterns, or limiting beliefs. You're reclaiming your power and choosing freedom.",
          "love": "Breaking free from unhealthy relationship patterns. Ending codependent or toxic relationships.",
          "career": "Breaking free from unfulfilling work or toxic workplace dynamics. Choosing purpose over materialism.",
          "health": "Overcoming addiction or unhealthy habits. Taking control of your health and wellbeing.",
          "spirituality": "Spiritual liberation and breaking free from limiting beliefs. Embracing your true spiritual nature."
        }
      },
      "symbolism": [
        "chained figures (bondage and choice)",
        "inverted pentagram (material over spiritual)",
        "torch (false enlightenment)",
        "bat wings (darkness)",
        "loose chains (choice to stay or leave)"
      ],
      "element": "earth",
      "astrology": "Capricorn",
      "numerology": "15 - material temptation, breaking free",
      "description": "A horned devil figure sits above two chained humans, but the chains are loose, representing that bondage is often a choice."
    },
    {
      "id": "tower",
      "name": "The Tower",
      "arcana": "major",
      "number": 16,
      "keywords": {
        "upright": [
          "sudden upheaval",
          "broken pride",
          "disaster",
          "revelation",
          "awakening"
        ],
        "reversed": [
          "disaster avoided",
          "delayed disaster",
          "fear of suffering",
          "internal transformation",
          "resistance to change"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Tower represents sudden upheaval, revelation, and the destruction of false beliefs. Sometimes destruction is necessary for rebuilding.",
          "love": "Sudden relationship upheaval or revelation of truth. A relationship built on false foundations may crumble.",
          "career": "Sudden career changes, job loss, or revelation about your work situation. Old structures must fall for new growth.",
          "health": "Sudden health crisis or wake-up call. Your body may be forcing you to pay attention to neglected issues.",
          "spirituality": "Spiritual awakening through crisis or sudden revelation. Old beliefs are being shattered for spiritual growth."
        },
        "reversed": {
          "general": "Avoiding necessary change, delaying inevitable transformation, or experiencing internal rather than external upheaval.",
          "love": "Avoiding necessary relationship changes or fearing relationship upheaval. Internal relationship work is needed.",
          "career": "Avoiding necessary career changes or fearing professional upheaval. Internal transformation is occurring.",
          "health": "Avoiding necessary health changes or fearing health crises. Internal healing work is needed.",
          "spirituality": "Resisting spiritual transformation or fearing spiritual upheaval. Internal spiritual work is occurring."
        }
      },
      "symbolism": [
        "lightning bolt (divine intervention)",
        "falling crown (ego destruction)",
        "falling figures (loss of control)",
        "crumbling tower (false structures)",
        "flames (purification)"
      ],
      "element": "fire",
      "astrology": "Mars",
      "numerology": "16 - destruction of false beliefs, awakening",
      "description": "A tall tower is struck by lightning, with figures falling from it, representing the sudden destruction of false beliefs and structures."
    },
    {
      "id": "star",
      "name": "The Star",
      "arcana": "major",
      "number": 17,
      "keywords": {
        "upright": [
          "hope",
          "faith",
          "rejuvenation",
          "inspiration",
          "healing"
        ],
        "reversed": [
          "faithlessness",
          "discouragement",
          "insecurity",
          "despair",
          "disconnection"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Star represents hope, faith, and spiritual guidance. After the upheaval of The Tower, The Star brings healing and renewal.",
          "love": "Renewed hope in love and relationships. Healing from past relationship wounds and opening your heart to new possibilities.",
          "career": "Inspiration and renewed purpose in your career. Your talents are being recognized and new opportunities are emerging.",
          "health": "Healing and recovery. Your body's natural healing abilities are enhanced. Alternative healing methods may be beneficial.",
          "spirituality": "Spiritual renewal and connection to divine guidance. You're receiving inspiration and spiritual healing."
        },
        "reversed": {
          "general": "Loss of faith, discouragement, or feeling disconnected from your spiritual guidance. You may be going through a dark night of the soul.",
          "love": "Discouragement in love or loss of faith in relationships. You may be feeling disconnected from your heart.",
          "career": "Lack of inspiration or direction in your career. You may be feeling discouraged about your professional path.",
          "health": "Discouragement about health issues or feeling disconnected from your body's healing abilities.",
          "spirituality": "Spiritual disconnection or loss of faith. You may be feeling abandoned by your spiritual guides."
        }
      },
      "symbolism": [
        "seven small stars (chakras)",
        "one large star (hope)",
        "naked woman (vulnerability and truth)",
        "water (emotions and intuition)",
        "ibis bird (wisdom)"
      ],
      "element": "air",
      "astrology": "Aquarius",
      "numerology": "17 - hope, spiritual guidance, inspiration",
      "description": "A naked woman kneels by a pool, pouring water while seven stars shine above her, representing hope and spiritual guidance after crisis."
    },
    {
      "id": "moon",
      "name": "The Moon",
      "arcana": "major",
      "number": 18,
      "keywords": {
        "upright": [
          "unconscious",
          "illusions",
          "intuition",
          "dreams",
          "mystery"
        ],
        "reversed": [
          "confusion",
          "fear",
          "misinterpretation",
          "deception",
          "anxiety"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Moon represents the unconscious mind, illusions, and intuition. Things are not as they seem, and you must trust your inner guidance.",
          "love": "Confusion or illusions in relationships. Trust your intuition about your partner's true feelings and motivations.",
          "career": "Uncertainty or confusion about your career path. Hidden information may be affecting your work situation.",
          "health": "Pay attention to your mental and emotional health. Anxiety or confusion may be affecting your physical wellbeing.",
          "spirituality": "Deep spiritual insights through dreams and intuition. You're exploring the mysteries of your unconscious mind."
        },
        "reversed": {
          "general": "Overcoming confusion and illusions. You're beginning to see things more clearly and trust your rational mind.",
          "love": "Clearing up confusion in relationships. Deceptions or misunderstandings are being revealed and resolved.",
          "career": "Gaining clarity about your career situation. Hidden information is coming to light.",
          "health": "Overcoming anxiety or mental confusion. You're gaining clarity about your health needs.",
          "spirituality": "Moving from confusion to clarity in your spiritual understanding. Illusions are being dispelled."
        }
      },
      "symbolism": [
        "full moon (unconscious)",
        "two towers (conscious and unconscious)",
        "path (spiritual journey)",
        "dog and wolf (tame and wild nature)",
        "crayfish (emerging from unconscious)"
      ],
      "element": "water",
      "astrology": "Pisces",
      "numerology": "18 - illusion, intuition, subconscious",
      "description": "A full moon shines down on a path between two towers, with a dog and wolf howling, representing the journey through illusion to truth."
    },
    {
      "id": "sun",
      "name": "The Sun",
      "arcana": "major",
      "number": 19,
      "keywords": {
        "upright": [
          "joy",
          "success",
          "celebration",
          "positivity",
          "vitality"
        ],
        "reversed": [
          "negativity",
          "depression",
          "sadness",
          "lack of enthusiasm",
          "delayed success"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Sun represents joy, success, and vitality. This is one of the most positive cards in the tarot, indicating happiness and achievement.",
          "love": "Joy and happiness in relationships. If single, you may meet someone who brings sunshine into your life. Existing relationships flourish.",
          "career": "Success and recognition in your career. Your hard work is paying off and you're achieving your professional goals.",
          "health": "Excellent health and vitality. You're feeling energetic and positive about your physical wellbeing.",
          "spirituality": "Spiritual joy and enlightenment. You're feeling connected to the divine and experiencing spiritual fulfillment."
        },
        "reversed": {
          "general": "Temporary setbacks or delays in achieving happiness. You may be experiencing negativity or lack of enthusiasm.",
          "love": "Temporary relationship difficulties or lack of joy in love. Communication issues may be clouding your happiness.",
          "career": "Delayed success or lack of recognition. You may be feeling discouraged about your professional progress.",
          "health": "Low energy or temporary health issues. You may be feeling less vital than usual.",
          "spirituality": "Temporary spiritual disconnection or lack of joy in your spiritual practice."
        }
      },
      "symbolism": [
        "bright sun (consciousness and joy)",
        "child on horse (innocence and freedom)",
        "sunflowers (loyalty and devotion)",
        "red banner (passion and energy)",
        "walled garden (security and growth)"
      ],
      "element": "fire",
      "astrology": "Sun",
      "numerology": "19 - success, joy, enlightenment",
      "description": "A bright sun shines down on a joyful child riding a white horse, with sunflowers growing in a walled garden, representing pure happiness and success."
    },
    {
      "id": "judgement",
      "name": "Judgement",
      "arcana": "major",
      "number": 20,
      "keywords": {
        "upright": [
          "reflection",
          "reckoning",
          "awakening",
          "rebirth",
          "inner calling"
        ],
        "reversed": [
          "lack of self awareness",
          "doubt",
          "self loathing",
          "harsh judgment",
          "avoiding responsibility"
        ]
      },
      "meanings": {
        "upright": {
          "general": "Judgement represents spiritual awakening, rebirth, and answering a higher calling. You're being called to a higher purpose.",
          "love": "A spiritual awakening in relationships. You may be called to forgive past hurts and embrace a new level of love.",
          "career": "A calling to a higher purpose in your work. You may be awakening to your true professional calling.",
          "health": "Spiritual and physical rebirth. You're awakening to new levels of health and vitality.",
          "spirituality": "Spiritual awakening and rebirth. You're answering a higher calling and embracing your spiritual purpose."
        },
        "reversed": {
          "general": "Self-doubt, harsh self-judgment, or avoiding your higher calling. You may be resisting necessary spiritual growth.",
          "love": "Harsh judgment of yourself or others in relationships. Avoiding forgiveness or spiritual growth in love.",
          "career": "Avoiding your true calling or being overly critical of your professional abilities.",
          "health": "Being overly critical of your body or avoiding necessary health changes.",
          "spirituality": "Spiritual self-doubt or avoiding your higher calling. Harsh judgment of your spiritual progress."
        }
      },
      "symbolism": [
        "angel gabriel (divine messenger)",
        "trumpet (call to awakening)",
        "rising figures (rebirth)",
        "cross flag (spiritual victory)",
        "mountains (higher consciousness)"
      ],
      "element": "fire",
      "astrology": "Pluto",
      "numerology": "20 - awakening, rebirth, higher calling",
      "description": "Angel Gabriel blows a trumpet while figures rise from their graves, representing spiritual awakening and rebirth to a higher calling."
    },
    {
      "id": "world",
      "name": "The World",
      "arcana": "major",
      "number": 21,
      "keywords": {
        "upright": [
          "fulfillment",
          "harmony",
          "completion",
          "travel",
          "accomplishment"
        ],
        "reversed": [
          "incompletion",
          "no closure",
          "lack of achievement",
          "delays",
          "unfulfilled goals"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The World represents completion, fulfillment, and achievement. You have reached a major milestone and are ready for the next cycle.",
          "love": "Complete fulfillment in relationships. You may be ready for marriage, or your relationship has reached a new level of harmony.",
          "career": "Achievement of major career goals. You have completed an important phase and are ready for new challenges.",
          "health": "Complete health and vitality. You have achieved your health goals and are in excellent physical condition.",
          "spirituality": "Spiritual completion and cosmic consciousness. You have achieved a major level of spiritual understanding."
        },
        "reversed": {
          "general": "Incomplete projects, lack of closure, or delays in achieving your goals. You may be close to completion but not quite there.",
          "love": "Incomplete relationship goals or lack of closure in love. You may be close to commitment but not ready yet.",
          "career": "Incomplete career goals or delays in professional achievement. You're close to success but need more effort.",
          "health": "Incomplete health goals or delays in achieving optimal wellness. You're on the right track but need persistence.",
          "spirituality": "Incomplete spiritual goals or delays in spiritual achievement. You're close to enlightenment but need more work."
        }
      },
      "symbolism": [
        "dancing figure (cosmic consciousness)",
        "wreath (victory and completion)",
        "four creatures (four elements)",
        "purple cloth (spiritual mastery)",
        "wands (manifestation)"
      ],
      "element": "earth",
      "astrology": "Saturn",
      "numerology": "21 - completion, fulfillment, cosmic consciousness",
      "description": "A dancing figure surrounded by a wreath, with the four creatures of the elements in the corners, representing complete fulfillment and cosmic consciousness."
    },
    {
      "id": "six_of_wands",
      "name": "Six of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 6,
      "element": "fire",
      "keywords": {
        "upright": [
          "victory",
          "success",
          "public recognition",
          "progress",
          "achievement"
        ],
        "reversed": [
          "private achievement",
          "personal success",
          "lack of recognition",
          "fall from grace",
          "egotism"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Six of Wands represents victory, success, and public recognition. Your hard work is paying off and others are taking notice.",
          "love": "Success in love and relationships. Your romantic efforts are being rewarded and recognized by your partner.",
          "career": "Professional success and recognition. You may receive a promotion, award, or public acknowledgment of your work.",
          "health": "Success in health goals. Your efforts to improve your wellbeing are showing positive results.",
          "spirituality": "Spiritual progress and recognition. Your spiritual growth is being acknowledged by your community."
        },
        "reversed": {
          "general": "Private success without public recognition, or a fall from grace. You may be achieving goals but not receiving credit.",
          "love": "Private relationship success or lack of recognition from your partner. Your efforts may go unnoticed.",
          "career": "Professional success without recognition, or loss of status. You may be achieving goals but not getting credit.",
          "health": "Private health improvements or setbacks in health goals. Your progress may not be visible to others.",
          "spirituality": "Private spiritual growth or loss of spiritual status. Your progress may be internal rather than recognized."
        }
      },
      "symbolism": [
        "rider on white horse (victory)",
        "laurel wreath (achievement)",
        "crowd (public recognition)",
        "six wands (progress)",
        "red cloak (passion and energy)"
      ],
      "astrology": "Jupiter in Leo",
      "numerology": "6 - harmony, responsibility, service",
      "description": "A victorious rider on a white horse holds a wand with a laurel wreath, while a crowd cheers and five other wands are held high in celebration."
    },
    {
      "id": "seven_of_wands",
      "name": "Seven of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 7,
      "element": "fire",
      "keywords": {
        "upright": [
          "perseverance",
          "defensive",
          "maintaining control",
          "protecting",
          "standing ground"
        ],
        "reversed": [
          "giving up",
          "overwhelmed",
          "lack of self-belief",
          "surrender",
          "weakness"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Seven of Wands represents perseverance and standing your ground. You're defending your position against challenges and maintaining control despite opposition.",
          "love": "Defending your relationship or standing up for your beliefs in love. You may face relationship challenges that require you to fight for what you believe in.",
          "career": "Defending your position at work or standing up for your professional beliefs. Competition may be fierce, but you have the advantage.",
          "health": "Fighting health challenges with determination. Your body is defending itself against illness and you must maintain your strength.",
          "spirituality": "Defending your spiritual beliefs or standing up for your spiritual values against opposition or doubt."
        },
        "reversed": {
          "general": "Giving up too easily or feeling overwhelmed by challenges. You may lack the confidence to defend yourself or your position.",
          "love": "Giving up on relationship challenges or feeling overwhelmed by relationship problems. You may be avoiding necessary confrontations.",
          "career": "Giving up on professional challenges or feeling overwhelmed at work. You may be losing your competitive edge.",
          "health": "Giving up on health challenges or feeling overwhelmed by health issues. You may lack the energy to fight.",
          "spirituality": "Giving up on spiritual challenges or feeling overwhelmed by spiritual growth. You may be losing faith in your beliefs."
        }
      },
      "symbolism": [
        "defensive stance (protection)",
        "high ground (advantage)",
        "six opposing wands (challenges)",
        "determination (perseverance)",
        "courage (bravery)"
      ],
      "astrology": "Mars in Leo",
      "numerology": "7 - spiritual awakening, inner wisdom, challenges",
      "description": "A figure stands on high ground, holding a wand defensively against six other wands rising from below, representing the need to defend your position."
    },
    {
      "id": "eight_of_wands",
      "name": "Eight of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 8,
      "element": "fire",
      "keywords": {
        "upright": [
          "speed",
          "rapid action",
          "movement",
          "quick decisions",
          "progress"
        ],
        "reversed": [
          "delays",
          "frustration",
          "lack of energy",
          "slow progress",
          "impatience"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Eight of Wands represents rapid movement and swift action. Things are happening quickly and progress is being made at an accelerated pace.",
          "love": "Rapid developments in love. A relationship may be moving quickly or you may receive important romantic news soon.",
          "career": "Rapid career progress or quick professional developments. Projects are moving forward swiftly and opportunities are arising.",
          "health": "Rapid health improvements or quick recovery from illness. Energy levels are high and vitality is returning.",
          "spirituality": "Rapid spiritual progress or quick spiritual insights. Your spiritual journey is accelerating and breakthroughs are occurring."
        },
        "reversed": {
          "general": "Delays, frustration, or slow progress. Things may be moving too slowly for your liking, causing impatience and frustration.",
          "love": "Delays in relationship progress or frustration with the pace of love. Communication may be slow or misunderstood.",
          "career": "Delays in career progress or frustration with work pace. Projects may be moving slowly or facing obstacles.",
          "health": "Slow health progress or delays in recovery. Energy levels may be low and healing may take longer than expected.",
          "spirituality": "Slow spiritual progress or delays in spiritual growth. Patience is needed as development takes time."
        }
      },
      "symbolism": [
        "eight flying wands (swift movement)",
        "clear sky (clarity)",
        "rapid movement (speed)",
        "countryside (peaceful progress)",
        "swift action (momentum)"
      ],
      "astrology": "Mercury in Sagittarius",
      "numerology": "8 - material mastery, inner strength, achievement",
      "description": "Eight wands fly swiftly through the air over a peaceful countryside, representing rapid movement and progress toward goals."
    },
    {
      "id": "nine_of_wands",
      "name": "Nine of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 9,
      "element": "fire",
      "keywords": {
        "upright": [
          "resilience",
          "persistence",
          "test of faith",
          "boundaries",
          "last stand"
        ],
        "reversed": [
          "exhaustion",
          "lack of resources",
          "giving up",
          "paranoia",
          "stubbornness"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Nine of Wands represents resilience and persistence. You're close to your goal but must maintain your strength for the final push.",
          "love": "Resilience in relationships. You may be tested but your love will endure if you persist through current challenges.",
          "career": "Professional resilience and persistence. You're close to success but must maintain your determination through final obstacles.",
          "health": "Health resilience and recovery. You're healing but must maintain your strength and continue your health regimen.",
          "spirituality": "Spiritual resilience and faith. Your beliefs are being tested but you must persist in your spiritual journey."
        },
        "reversed": {
          "general": "Exhaustion, giving up, or lack of resources. You may be too tired to continue the fight or lacking support.",
          "love": "Relationship exhaustion or giving up on love. You may be too tired to work on the relationship or feeling unsupported.",
          "career": "Professional exhaustion or giving up on career goals. You may lack the resources or energy to continue.",
          "health": "Health exhaustion or giving up on health goals. You may lack the energy to continue healing or maintaining wellness.",
          "spirituality": "Spiritual exhaustion or giving up on spiritual growth. You may lack the faith or energy to continue your journey."
        }
      },
      "symbolism": [
        "wounded figure (battle-tested)",
        "eight wands behind (past victories)",
        "one wand in hand (final defense)",
        "bandaged head (experience)",
        "defensive posture (vigilance)"
      ],
      "astrology": "Moon in Sagittarius",
      "numerology": "9 - resilience, wisdom, spiritual awareness, near completion",
      "description": "A wounded but determined figure leans on a wand, with eight other wands standing behind like a protective barrier, showing resilience near the end."
    },
    {
      "id": "ten_of_wands",
      "name": "Ten of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 10,
      "element": "fire",
      "keywords": {
        "upright": [
          "burden",
          "hard work",
          "responsibility",
          "stress",
          "achievement"
        ],
        "reversed": [
          "release",
          "delegation",
          "burden sharing",
          "collapse",
          "giving up"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ten of Wands represents burden and hard work. You're carrying a heavy load but success is within reach if you persevere.",
          "love": "Heavy responsibilities in relationships. You may be carrying too much of the emotional burden or working hard to maintain the relationship.",
          "career": "Heavy work responsibilities or stress. You're working hard toward success but may be taking on too much.",
          "health": "Physical or emotional burden affecting your health. You may be carrying too much stress or overworking yourself.",
          "spirituality": "Spiritual responsibilities or burden. You may be taking on too much spiritual work or feeling weighed down by obligations."
        },
        "reversed": {
          "general": "Release from burden, delegation, or collapse under pressure. You may need to share the load or let go of some responsibilities.",
          "love": "Release from relationship burdens or sharing emotional responsibilities more equally. Learning to delegate in love.",
          "career": "Release from work burdens or delegation of responsibilities. You may need help or should consider reducing your workload.",
          "health": "Release from health burdens or sharing the responsibility for your wellbeing. Seeking help and support.",
          "spirituality": "Release from spiritual burdens or sharing spiritual responsibilities with others. Finding balance in spiritual practice."
        }
      },
      "symbolism": [
        "bent figure (burden)",
        "ten heavy wands (overwhelming load)",
        "burden (responsibility)",
        "near destination (success close)",
        "perseverance (determination)"
      ],
      "astrology": "Saturn in Sagittarius",
      "numerology": "10 - completion, fulfillment, new cycle beginning, achievement",
      "description": "A bent figure struggles to carry ten heavy wands, nearly reaching their destination despite the overwhelming burden."
    },
    {
      "id": "page_of_wands",
      "name": "Page of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 11,
      "element": "fire",
      "keywords": {
        "upright": [
          "enthusiasm",
          "exploration",
          "excitement",
          "freedom",
          "adventure"
        ],
        "reversed": [
          "lack of direction",
          "lack of passion",
          "limited options",
          "procrastination",
          "setbacks"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Page of Wands represents enthusiasm, exploration, and new adventures. You're ready to embark on a new journey with excitement and passion.",
          "love": "Enthusiasm and excitement in love. You may be exploring new romantic possibilities or bringing fresh energy to existing relationships.",
          "career": "Enthusiasm for new career opportunities or projects. You're ready to explore new professional paths with passion and excitement.",
          "health": "Enthusiasm for new health routines or treatments. You're excited about improving your wellbeing and trying new approaches.",
          "spirituality": "Enthusiasm for spiritual exploration and growth. You're excited about discovering new spiritual practices or deepening your understanding."
        },
        "reversed": {
          "general": "Lack of direction, passion, or enthusiasm. You may be feeling stuck or uncertain about which path to take.",
          "love": "Lack of passion or direction in love. You may be feeling uncertain about romantic relationships or lacking enthusiasm.",
          "career": "Lack of direction or passion in your career. You may be feeling stuck professionally or uncertain about your path.",
          "health": "Lack of enthusiasm for health improvements or feeling stuck in unhealthy patterns. You may need motivation.",
          "spirituality": "Lack of direction or passion in spiritual growth. You may be feeling disconnected from your spiritual path."
        }
      },
      "symbolism": [
        "young figure (new beginnings)",
        "wand (creative potential)",
        "desert landscape (exploration)",
        "salamanders (transformation)",
        "adventurous spirit (enthusiasm)"
      ],
      "astrology": "Earth of Fire",
      "numerology": "Page - messenger, student, new beginnings",
      "description": "A young figure holds a wand and gazes into the distance, ready for adventure and new discoveries in a desert landscape."
    },
    {
      "id": "knight_of_wands",
      "name": "Knight of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 12,
      "element": "fire",
      "keywords": {
        "upright": [
          "action",
          "impulsiveness",
          "adventure",
          "energy",
          "fearlessness"
        ],
        "reversed": [
          "recklessness",
          "haste",
          "scattered energy",
          "delays",
          "frustration"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Knight of Wands represents action, adventure, and fearless pursuit of goals. You're ready to charge forward with energy and enthusiasm.",
          "love": "Passionate and impulsive approach to love. You may be swept off your feet or taking bold romantic action.",
          "career": "Taking bold action in your career. You're ready to pursue opportunities with energy and determination.",
          "health": "High energy and active approach to health. You're motivated to take action to improve your wellbeing.",
          "spirituality": "Passionate spiritual pursuit and adventurous exploration of beliefs. You're actively seeking spiritual growth."
        },
        "reversed": {
          "general": "Recklessness, haste, or scattered energy. You may be acting without thinking or lacking focus in your actions.",
          "love": "Reckless or impulsive behavior in love. You may be rushing into relationships or acting without consideration.",
          "career": "Reckless career decisions or scattered professional energy. You may be acting hastily without proper planning.",
          "health": "Reckless health behaviors or scattered approach to wellness. You may be overdoing it or lacking consistency.",
          "spirituality": "Scattered spiritual energy or reckless spiritual pursuits. You may be jumping between practices without focus."
        }
      },
      "symbolism": [
        "charging horse (swift action)",
        "armor (protection)",
        "wand (creative power)",
        "desert landscape (adventure)",
        "salamanders (transformation)"
      ],
      "astrology": "Fire of Fire",
      "numerology": "Knight - action, movement, quest",
      "description": "A knight in armor charges forward on a rearing horse, holding a wand, representing bold action and adventurous spirit."
    },
    {
      "id": "queen_of_wands",
      "name": "Queen of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 13,
      "element": "fire",
      "keywords": {
        "upright": [
          "confidence",
          "determination",
          "social butterfly",
          "energetic",
          "vivacious"
        ],
        "reversed": [
          "selfishness",
          "jealousy",
          "insecurity",
          "temperamental",
          "demanding"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Queen of Wands represents confidence, determination, and vibrant energy. You're charismatic, optimistic, and able to inspire others.",
          "love": "Confident and passionate approach to love. You're attractive, warm, and able to inspire devotion in others.",
          "career": "Confident leadership and entrepreneurial spirit. You're able to inspire teams and achieve ambitious goals.",
          "health": "Vibrant health and energetic approach to wellness. You're motivated and able to maintain healthy habits.",
          "spirituality": "Confident spiritual leadership and inspiring others on their spiritual journey. You're a beacon of spiritual light."
        },
        "reversed": {
          "general": "Selfishness, jealousy, or insecurity. You may be demanding attention or acting in a temperamental manner.",
          "love": "Jealousy, possessiveness, or demanding behavior in relationships. You may be insecure about your attractiveness.",
          "career": "Selfish leadership or demanding behavior at work. You may be jealous of others' success or acting temperamentally.",
          "health": "Neglecting health due to selfishness or demanding too much from your body. You may be ignoring warning signs.",
          "spirituality": "Spiritual selfishness or jealousy of others' spiritual progress. You may be demanding spiritual attention."
        }
      },
      "symbolism": [
        "throne (authority)",
        "sunflowers (loyalty)",
        "black cat (intuition)",
        "wand (creative power)",
        "confident posture (self-assurance)"
      ],
      "astrology": "Water of Fire",
      "numerology": "Queen - nurturing, intuitive, mature feminine",
      "description": "A confident queen sits on her throne holding a wand and sunflower, with a black cat at her feet, representing charismatic leadership."
    },
    {
      "id": "king_of_wands",
      "name": "King of Wands",
      "arcana": "minor",
      "suit": "wands",
      "number": 14,
      "element": "fire",
      "keywords": {
        "upright": [
          "leadership",
          "vision",
          "entrepreneur",
          "honour",
          "charisma"
        ],
        "reversed": [
          "impulsiveness",
          "haste",
          "ruthless",
          "high expectations",
          "aggressive"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The King of Wands represents natural leadership, vision, and entrepreneurial spirit. You're a charismatic leader who inspires others to achieve great things.",
          "love": "Strong, passionate leadership in relationships. You're protective, generous, and able to inspire your partner to be their best.",
          "career": "Visionary leadership and entrepreneurial success. You're able to see the big picture and inspire teams to achieve ambitious goals.",
          "health": "Strong vitality and leadership in health matters. You're motivated to maintain excellent health and may inspire others.",
          "spirituality": "Spiritual leadership and vision. You're able to inspire others on their spiritual journey and lead by example."
        },
        "reversed": {
          "general": "Impulsiveness, ruthlessness, or aggressive leadership. You may be acting hastily or having unrealistic expectations of others.",
          "love": "Aggressive or controlling behavior in relationships. You may be too demanding or acting impulsively in love.",
          "career": "Ruthless or impulsive leadership. You may be having unrealistic expectations of your team or acting aggressively.",
          "health": "Impulsive health decisions or aggressive approach to wellness. You may be pushing yourself or others too hard.",
          "spirituality": "Aggressive spiritual leadership or impulsive spiritual decisions. You may be too demanding of spiritual progress."
        }
      },
      "symbolism": [
        "throne (authority)",
        "salamanders (transformation)",
        "crown (leadership)",
        "wand (creative power)",
        "regal bearing (natural authority)"
      ],
      "astrology": "Air of Fire",
      "numerology": "King - mastery, authority, mature masculine",
      "description": "A powerful king sits confidently on his throne, holding a wand, with salamanders decorating his robes, representing visionary leadership."
    },
    {
      "id": "four_of_cups",
      "name": "Four of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 4,
      "element": "water",
      "keywords": {
        "upright": [
          "apathy",
          "contemplation",
          "disconnection",
          "boredom",
          "missed opportunities"
        ],
        "reversed": [
          "motivation",
          "clarity",
          "acceptance",
          "new possibilities",
          "renewed interest"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Four of Cups represents apathy, contemplation, and missed opportunities. You may be feeling disconnected or bored with current circumstances.",
          "love": "Emotional disconnection or apathy in relationships. You may be taking your partner for granted or missing romantic opportunities.",
          "career": "Boredom or apathy at work. You may be missing career opportunities or feeling disconnected from your professional goals.",
          "health": "Emotional or physical apathy affecting your health. You may be neglecting self-care or feeling disconnected from your body.",
          "spirituality": "Spiritual apathy or disconnection. You may be feeling bored with your spiritual practice or missing spiritual opportunities."
        },
        "reversed": {
          "general": "Renewed motivation, clarity, and acceptance of new possibilities. You're ready to engage with life again and see new opportunities.",
          "love": "Renewed interest in love and relationships. You're ready to appreciate your partner or be open to new romantic possibilities.",
          "career": "Renewed motivation and clarity about career goals. You're ready to pursue new opportunities with enthusiasm.",
          "health": "Renewed motivation for health and wellness. You're ready to take better care of yourself and try new approaches.",
          "spirituality": "Renewed spiritual interest and clarity. You're ready to explore new spiritual practices or deepen existing ones."
        }
      },
      "symbolism": [
        "seated figure (contemplation)",
        "three cups before (current options)",
        "fourth cup offered (new opportunity)",
        "crossed arms (resistance)",
        "tree (growth potential)"
      ],
      "astrology": "Moon in Cancer",
      "numerology": "4 - stability, foundation, contemplation",
      "description": "A figure sits under a tree with arms crossed, contemplating three cups while a fourth cup is offered from a cloud, representing missed opportunities."
    },
    {
      "id": "five_of_cups",
      "name": "Five of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 5,
      "element": "water",
      "keywords": {
        "upright": [
          "loss",
          "grief",
          "disappointment",
          "regret",
          "moving on"
        ],
        "reversed": [
          "acceptance",
          "healing",
          "forgiveness",
          "recovery",
          "learning from loss"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Five of Cups represents loss, grief, and disappointment. While you're focused on what's been lost, there are still opportunities remaining.",
          "love": "Relationship loss, heartbreak, or disappointment in love. You're grieving what was lost but healing is possible.",
          "career": "Professional disappointment, job loss, or career setbacks. You're focusing on failures but opportunities remain.",
          "health": "Health setbacks or disappointment with treatment results. You're grieving losses but recovery is possible.",
          "spirituality": "Spiritual disappointment or loss of faith. You're grieving spiritual losses but renewal is possible."
        },
        "reversed": {
          "general": "Acceptance of loss, healing, and learning from disappointment. You're ready to move forward and see new possibilities.",
          "love": "Healing from heartbreak, forgiveness, and readiness for new love. You're learning from past relationship losses.",
          "career": "Recovery from professional setbacks and learning from career disappointments. You're ready for new opportunities.",
          "health": "Recovery from health setbacks and learning from health challenges. You're ready to try new approaches.",
          "spirituality": "Spiritual healing and recovery from loss of faith. You're learning from spiritual disappointments and growing."
        }
      },
      "symbolism": [
        "three spilled cups (loss)",
        "two standing cups (remaining opportunities)",
        "cloaked figure (grief)",
        "bridge (path forward)",
        "flowing water (emotions)"
      ],
      "astrology": "Mars in Scorpio",
      "numerology": "5 - change, challenge, learning through difficulty",
      "description": "A cloaked figure mourns over three spilled cups while two cups remain standing behind, with a bridge in the distance representing hope."
    },
    {
      "id": "six_of_cups",
      "name": "Six of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 6,
      "element": "water",
      "keywords": {
        "upright": [
          "nostalgia",
          "childhood memories",
          "innocence",
          "reunion",
          "generosity"
        ],
        "reversed": [
          "stuck in past",
          "naivety",
          "lack of creativity",
          "unrealistic expectations",
          "childhood issues"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Six of Cups represents nostalgia, childhood memories, and innocent joy. You may be reconnecting with your past or experiencing simple pleasures.",
          "love": "Nostalgic love, childhood sweethearts, or innocent romantic feelings. You may be reconnecting with someone from your past.",
          "career": "Returning to past interests or reconnecting with former colleagues. You may find joy in simple, creative work.",
          "health": "Healing through reconnecting with simple pleasures and childhood joys. Inner child healing may be beneficial.",
          "spirituality": "Spiritual innocence and returning to simple spiritual practices. You're reconnecting with your spiritual roots."
        },
        "reversed": {
          "general": "Being stuck in the past, unrealistic expectations, or naivety. You may be avoiding present responsibilities by dwelling on the past.",
          "love": "Stuck in past relationships or having unrealistic romantic expectations. You may be idealizing past loves.",
          "career": "Stuck in outdated career approaches or having unrealistic professional expectations. You may be avoiding growth.",
          "health": "Stuck in unhealthy patterns from the past or having unrealistic health expectations. You may need to face current realities.",
          "spirituality": "Stuck in outdated spiritual beliefs or having unrealistic spiritual expectations. You may need to grow beyond past practices."
        }
      },
      "symbolism": [
        "children (innocence)",
        "cups with flowers (gifts)",
        "village setting (community)",
        "white flowers (purity)",
        "giving and receiving (generosity)"
      ],
      "astrology": "Sun in Scorpio",
      "numerology": "6 - harmony, responsibility, nurturing, service",
      "description": "Children exchange cups filled with flowers in a village setting, representing innocent generosity and nostalgic memories."
    },
    {
      "id": "seven_of_cups",
      "name": "Seven of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 7,
      "element": "water",
      "keywords": {
        "upright": [
          "choices",
          "fantasy",
          "illusion",
          "opportunities",
          "daydreaming"
        ],
        "reversed": [
          "clarity",
          "focus",
          "commitment",
          "decision making",
          "reality check"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Seven of Cups represents choices, fantasy, and illusion. You may be facing many options or getting lost in daydreams and possibilities.",
          "love": "Multiple romantic options or fantasizing about ideal love. You may be seeing potential partners through rose-colored glasses.",
          "career": "Multiple career options or unrealistic professional fantasies. You may need to distinguish between viable opportunities and wishful thinking.",
          "health": "Confusion about health choices or unrealistic health expectations. You may be exploring too many wellness options at once.",
          "spirituality": "Spiritual confusion or being drawn to multiple spiritual paths. You may need to distinguish between genuine guidance and illusion."
        },
        "reversed": {
          "general": "Clarity, focus, and commitment to reality. You're ready to make decisions and distinguish between fantasy and viable options.",
          "love": "Clarity about romantic choices and commitment to reality. You're seeing potential partners more clearly.",
          "career": "Focus on realistic career goals and commitment to viable opportunities. You're making practical professional decisions.",
          "health": "Clarity about health choices and commitment to realistic wellness goals. You're focusing on what truly works.",
          "spirituality": "Spiritual clarity and commitment to a specific path. You're distinguishing between genuine guidance and illusion."
        }
      },
      "symbolism": [
        "seven cups (choices)",
        "clouds (illusion)",
        "various contents (different desires)",
        "shadowy figure (confusion)",
        "snake (temptation)"
      ],
      "astrology": "Venus in Scorpio",
      "numerology": "7 - spiritual awakening, inner wisdom, choices",
      "description": "A shadowy figure faces seven cups floating on a cloud, each containing different temptations and possibilities, representing choices and illusions."
    },
    {
      "id": "eight_of_cups",
      "name": "Eight of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 8,
      "element": "water",
      "keywords": {
        "upright": [
          "walking away",
          "seeking truth",
          "spiritual journey",
          "abandonment",
          "moving on"
        ],
        "reversed": [
          "fear of change",
          "stagnation",
          "avoiding truth",
          "staying in comfort zone",
          "false starts"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Eight of Cups represents walking away from what no longer serves you and seeking deeper meaning. You're ready to leave behind material success for spiritual fulfillment.",
          "love": "Walking away from an unfulfilling relationship or seeking deeper emotional connection. You're ready to leave behind superficial love.",
          "career": "Leaving a successful but unfulfilling career to seek meaningful work. You're prioritizing purpose over material success.",
          "health": "Abandoning unhealthy habits or seeking holistic healing approaches. You're ready to leave behind what doesn't serve your wellbeing.",
          "spirituality": "Embarking on a spiritual journey or seeking deeper truth. You're ready to leave behind superficial spiritual practices."
        },
        "reversed": {
          "general": "Fear of change, staying in your comfort zone, or avoiding necessary transitions. You may be afraid to leave what's familiar.",
          "love": "Fear of leaving an unfulfilling relationship or avoiding necessary relationship changes. You may be staying for security.",
          "career": "Fear of leaving an unfulfilling job or avoiding necessary career changes. You may be staying for financial security.",
          "health": "Avoiding necessary health changes or staying in unhealthy patterns. You may be afraid to try new approaches.",
          "spirituality": "Avoiding spiritual growth or staying in comfortable but limiting spiritual practices. You may fear deeper exploration."
        }
      },
      "symbolism": [
        "walking figure (journey)",
        "eight cups left behind (abandonment)",
        "mountains (challenges ahead)",
        "moon (intuition)",
        "staff (spiritual support)"
      ],
      "astrology": "Saturn in Pisces",
      "numerology": "8 - material mastery, inner strength, transformation",
      "description": "A cloaked figure walks away from eight cups toward distant mountains under a crescent moon, representing the spiritual journey beyond material success."
    },
    {
      "id": "nine_of_cups",
      "name": "Nine of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 9,
      "element": "water",
      "keywords": {
        "upright": [
          "satisfaction",
          "contentment",
          "gratitude",
          "wish fulfillment",
          "emotional stability"
        ],
        "reversed": [
          "dissatisfaction",
          "greed",
          "materialism",
          "lack of fulfillment",
          "smugness"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Nine of Cups represents satisfaction, contentment, and wish fulfillment. Known as the 'wish card,' it indicates that your desires are being fulfilled.",
          "love": "Emotional satisfaction and contentment in relationships. Your romantic wishes are being fulfilled and you feel deeply happy.",
          "career": "Professional satisfaction and achievement of career goals. You're feeling fulfilled and content with your work success.",
          "health": "Good health and satisfaction with your physical wellbeing. You're feeling strong, healthy, and content with your body.",
          "spirituality": "Spiritual satisfaction and contentment. You're feeling fulfilled in your spiritual practice and connected to your higher self."
        },
        "reversed": {
          "general": "Dissatisfaction despite material success, greed, or smugness. You may be focusing too much on material gains or feeling empty despite achievements.",
          "love": "Dissatisfaction in relationships despite apparent success, or being smug about romantic achievements. You may be taking love for granted.",
          "career": "Professional dissatisfaction despite success, or being smug about career achievements. You may be focusing too much on status.",
          "health": "Dissatisfaction with health despite good physical condition, or being smug about health achievements. You may be neglecting emotional wellbeing.",
          "spirituality": "Spiritual dissatisfaction despite apparent progress, or being smug about spiritual achievements. You may be focusing on ego rather than growth."
        }
      },
      "symbolism": [
        "satisfied figure (contentment)",
        "nine cups displayed (abundance)",
        "crossed arms (satisfaction)",
        "feast setting (celebration)",
        "smile (happiness)"
      ],
      "astrology": "Jupiter in Pisces",
      "numerology": "9 - completion, wisdom, spiritual awareness, fulfillment",
      "description": "A satisfied figure sits with arms crossed before nine cups arranged in an arc, representing contentment and wish fulfillment."
    },
    {
      "id": "ten_of_cups",
      "name": "Ten of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 10,
      "element": "water",
      "keywords": {
        "upright": [
          "happiness",
          "family harmony",
          "emotional fulfillment",
          "domestic bliss",
          "community"
        ],
        "reversed": [
          "family conflict",
          "broken relationships",
          "lack of harmony",
          "unrealistic expectations",
          "superficial happiness"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ten of Cups represents ultimate emotional fulfillment, family harmony, and domestic bliss. This is the 'happily ever after' card of the tarot.",
          "love": "Perfect family harmony and emotional fulfillment in relationships. You've achieved the ideal of love and domestic happiness.",
          "career": "Emotional fulfillment through work that serves the community. You're finding meaning and happiness in your professional life.",
          "health": "Emotional and physical wellbeing supported by loving family and community. You're experiencing holistic health and happiness.",
          "spirituality": "Spiritual fulfillment through community and service to others. You're experiencing divine love and connection."
        },
        "reversed": {
          "general": "Family conflict, broken relationships, or unrealistic expectations about happiness. The ideal may be disrupted or superficial.",
          "love": "Family discord, relationship conflicts, or unrealistic expectations about love. The 'perfect family' ideal may be challenged.",
          "career": "Lack of emotional fulfillment at work or conflicts with colleagues. You may be seeking meaning that work cannot provide.",
          "health": "Health issues affecting family harmony or lack of emotional support for wellbeing. Stress from family conflicts may impact health.",
          "spirituality": "Spiritual disconnection from community or unrealistic expectations about spiritual fulfillment. You may be seeking perfection rather than growth."
        }
      },
      "symbolism": [
        "happy family (harmony)",
        "rainbow (divine blessing)",
        "ten cups in arc (completion)",
        "children playing (innocence)",
        "home (security)"
      ],
      "astrology": "Mars in Pisces",
      "numerology": "10 - completion, fulfillment, new cycle beginning, perfection",
      "description": "A happy family celebrates under a rainbow with ten cups arranged in an arc above them, representing ultimate emotional fulfillment and domestic bliss."
    },
    {
      "id": "page_of_cups",
      "name": "Page of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 11,
      "element": "water",
      "keywords": {
        "upright": [
          "intuition",
          "creativity",
          "emotional messages",
          "artistic inspiration",
          "sensitivity"
        ],
        "reversed": [
          "emotional immaturity",
          "moodiness",
          "creative blocks",
          "unrealistic dreams",
          "oversensitivity"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Page of Cups represents intuition, creativity, and emotional messages. You're open to new emotional experiences and creative inspiration.",
          "love": "New emotional experiences, romantic messages, or intuitive insights about love. You may receive news about relationships.",
          "career": "Creative inspiration, intuitive insights about work, or emotional fulfillment through career. You may receive important professional news.",
          "health": "Intuitive insights about health, emotional healing, or sensitivity to your body's needs. You may receive important health information.",
          "spirituality": "Spiritual messages, intuitive insights, or emotional spiritual experiences. You're open to divine guidance and inspiration."
        },
        "reversed": {
          "general": "Emotional immaturity, moodiness, or creative blocks. You may be overly sensitive or having unrealistic expectations.",
          "love": "Emotional immaturity in relationships, moodiness, or unrealistic romantic expectations. You may be overly sensitive to criticism.",
          "career": "Creative blocks, emotional immaturity at work, or unrealistic career expectations. You may be too sensitive to professional feedback.",
          "health": "Emotional immaturity affecting health, moodiness, or unrealistic health expectations. You may be overly sensitive to physical sensations.",
          "spirituality": "Spiritual immaturity, emotional blocks to growth, or unrealistic spiritual expectations. You may be too sensitive to spiritual criticism."
        }
      },
      "symbolism": [
        "young figure (new beginnings)",
        "cup with fish (intuitive messages)",
        "water (emotions)",
        "gentle expression (sensitivity)",
        "artistic clothing (creativity)"
      ],
      "astrology": "Earth of Water",
      "numerology": "Page - messenger, student, new emotional beginnings",
      "description": "A young figure holds a cup with a fish emerging from it, representing intuitive messages and creative inspiration from the emotional realm."
    },
    {
      "id": "knight_of_cups",
      "name": "Knight of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 12,
      "element": "water",
      "keywords": {
        "upright": [
          "romance",
          "charm",
          "emotional pursuit",
          "idealism",
          "following heart"
        ],
        "reversed": [
          "moodiness",
          "emotional manipulation",
          "unrealistic expectations",
          "jealousy",
          "emotional instability"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Knight of Cups represents romance, charm, and following your heart. You're pursuing your emotional desires with passion and idealism.",
          "love": "Romantic pursuit, charming courtship, or following your heart in love. You may be swept away by romantic idealism.",
          "career": "Following your passion in work, creative pursuits, or emotionally fulfilling career choices. You're prioritizing meaning over money.",
          "health": "Following your intuition about health, emotional healing, or holistic approaches to wellness. You're listening to your body's emotional needs.",
          "spirituality": "Following your heart in spiritual matters, emotional spiritual experiences, or romantic idealism about spirituality."
        },
        "reversed": {
          "general": "Moodiness, emotional manipulation, or unrealistic expectations. You may be letting emotions cloud your judgment.",
          "love": "Emotional manipulation, jealousy, or unrealistic romantic expectations. You may be moody or unstable in relationships.",
          "career": "Emotional instability at work, unrealistic career expectations, or using emotions to manipulate professional situations.",
          "health": "Emotional instability affecting health, unrealistic health expectations, or using illness to manipulate others.",
          "spirituality": "Emotional manipulation in spiritual contexts, unrealistic spiritual expectations, or moodiness affecting spiritual growth."
        }
      },
      "symbolism": [
        "knight on horse (emotional pursuit)",
        "cup (emotional offering)",
        "flowing water (emotions)",
        "winged helmet (inspiration)",
        "fish on armor (intuition)"
      ],
      "astrology": "Fire of Water",
      "numerology": "Knight - action, movement, emotional quest",
      "description": "A knight on a white horse offers a cup, with fish decorating his armor and wings on his helmet, representing romantic pursuit and emotional idealism."
    },
    {
      "id": "queen_of_cups",
      "name": "Queen of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 13,
      "element": "water",
      "keywords": {
        "upright": [
          "intuition",
          "compassion",
          "emotional intelligence",
          "psychic abilities",
          "nurturing"
        ],
        "reversed": [
          "emotional insecurity",
          "codependency",
          "martyrdom",
          "mood swings",
          "lack of boundaries"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Queen of Cups represents intuition, compassion, and emotional intelligence. You're deeply empathetic and able to understand others' emotions.",
          "love": "Emotional intelligence and compassion in relationships. You're nurturing, intuitive, and able to provide emotional support to your partner.",
          "career": "Using emotional intelligence and intuition in work. You're able to understand and support colleagues and clients with compassion.",
          "health": "Emotional healing and intuitive health insights. You're able to understand your body's emotional needs and provide self-care.",
          "spirituality": "Psychic abilities, intuitive spiritual insights, and compassionate spiritual practice. You're deeply connected to spiritual realms."
        },
        "reversed": {
          "general": "Emotional insecurity, codependency, or lack of boundaries. You may be overly emotional or sacrificing yourself for others.",
          "love": "Codependency, emotional manipulation, or martyrdom in relationships. You may be sacrificing too much or lacking emotional boundaries.",
          "career": "Emotional insecurity at work, codependent professional relationships, or martyrdom in career. You may be taking on too much emotional burden.",
          "health": "Emotional insecurity affecting health, codependent health behaviors, or martyrdom around health issues. You may be neglecting self-care.",
          "spirituality": "Spiritual codependency, emotional manipulation in spiritual contexts, or martyrdom in spiritual practice. You may lack spiritual boundaries."
        }
      },
      "symbolism": [
        "throne by water (emotional authority)",
        "ornate cup (intuitive vessel)",
        "water (emotions and intuition)",
        "angels on throne (divine guidance)",
        "calm expression (emotional stability)"
      ],
      "astrology": "Water of Water",
      "numerology": "Queen - nurturing, intuitive, mature feminine emotional wisdom",
      "description": "A serene queen sits on a throne by the water's edge, holding an ornate cup and gazing thoughtfully, representing emotional wisdom and intuitive leadership."
    },
    {
      "id": "king_of_cups",
      "name": "King of Cups",
      "arcana": "minor",
      "suit": "cups",
      "number": 14,
      "element": "water",
      "keywords": {
        "upright": [
          "emotional balance",
          "compassion",
          "diplomacy",
          "wisdom",
          "calm leadership"
        ],
        "reversed": [
          "emotional manipulation",
          "moodiness",
          "lack of compassion",
          "emotional volatility",
          "abuse of power"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The King of Cups represents emotional balance, compassion, and wise leadership. You're able to remain calm and diplomatic while leading with your heart.",
          "love": "Emotional maturity and balanced leadership in relationships. You're compassionate, understanding, and able to provide stable emotional support.",
          "career": "Wise and compassionate leadership at work. You're able to balance emotions with logic and lead with both heart and mind.",
          "health": "Emotional balance supporting physical health. You're able to manage stress and maintain emotional equilibrium for overall wellbeing.",
          "spirituality": "Spiritual wisdom and emotional balance. You're able to lead others spiritually with compassion and understanding."
        },
        "reversed": {
          "general": "Emotional manipulation, moodiness, or abuse of emotional power. You may be using emotions to control others or lacking emotional stability.",
          "love": "Emotional manipulation or volatility in relationships. You may be using emotions to control your partner or lacking emotional maturity.",
          "career": "Emotional manipulation at work or volatile leadership. You may be using emotions inappropriately in professional settings.",
          "health": "Emotional volatility affecting health or using health issues to manipulate others. You may be emotionally unstable.",
          "spirituality": "Spiritual manipulation or emotional volatility in spiritual contexts. You may be using spirituality to control others emotionally."
        }
      },
      "symbolism": [
        "throne on water (emotional mastery)",
        "cup (emotional wisdom)",
        "calm seas (emotional stability)",
        "fish pendant (intuition)",
        "ship in distance (emotional journey)"
      ],
      "astrology": "Air of Water",
      "numerology": "King - mastery, authority, mature masculine emotional wisdom",
      "description": "A wise king sits on a throne surrounded by calm waters, holding a cup, with a fish pendant and ship in the distance, representing emotional mastery and compassionate leadership."
    },
    {
      "id": "two_of_swords",
      "name": "Two of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 2,
      "element": "air",
      "keywords": {
        "upright": [
          "difficult decisions",
          "weighing options",
          "indecision",
          "blocked emotions",
          "stalemate"
        ],
        "reversed": [
          "clarity",
          "making decisions",
          "emotional release",
          "breakthrough",
          "moving forward"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Two of Swords represents difficult decisions, indecision, and being at a crossroads. You're weighing options but may be avoiding making a choice.",
          "love": "Difficult relationship decisions or emotional blockages. You may be torn between two people or avoiding relationship choices.",
          "career": "Professional indecision or being stuck between career options. You may be avoiding making important work decisions.",
          "health": "Difficulty making health decisions or avoiding medical choices. You may be torn between different treatment options.",
          "spirituality": "Spiritual indecision or being torn between different beliefs. You may be avoiding important spiritual choices."
        },
        "reversed": {
          "general": "Clarity emerging, making decisions, and moving forward. You're ready to break through indecision and take action.",
          "love": "Clarity about relationship decisions and emotional breakthrough. You're ready to make important romantic choices.",
          "career": "Professional clarity and decisive action. You're ready to make important career decisions and move forward.",
          "health": "Clarity about health decisions and taking action. You're ready to make important health choices.",
          "spirituality": "Spiritual clarity and decisive spiritual action. You're ready to commit to a spiritual path."
        }
      },
      "symbolism": [
        "blindfolded figure (avoiding truth)",
        "two crossed swords (difficult choice)",
        "calm water (suppressed emotions)",
        "crescent moon (intuition blocked)",
        "balanced posture (weighing options)"
      ],
      "astrology": "Moon in Libra",
      "numerology": "2 - duality, balance, cooperation, choice",
      "description": "A blindfolded figure sits holding two crossed swords, with calm water behind, representing the difficulty of making decisions when emotions are blocked."
    },
    {
      "id": "four_of_swords",
      "name": "Four of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 4,
      "element": "air",
      "keywords": {
        "upright": [
          "rest",
          "meditation",
          "contemplation",
          "recovery",
          "mental peace"
        ],
        "reversed": [
          "restlessness",
          "burnout",
          "lack of progress",
          "mental exhaustion",
          "avoiding problems"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Four of Swords represents rest, meditation, and mental recovery. You need to take a break and recharge your mental energy.",
          "love": "Taking a break from relationship stress or needing space to think about love. Mental rest is needed for relationship clarity.",
          "career": "Taking a break from work stress or needing time to think about career direction. Mental rest is essential for professional clarity.",
          "health": "Mental and physical rest needed for recovery. Meditation and relaxation are important for healing.",
          "spirituality": "Spiritual rest and contemplation. You need quiet time for spiritual reflection and inner peace."
        },
        "reversed": {
          "general": "Restlessness, burnout, or avoiding necessary rest. You may be pushing yourself too hard or avoiding dealing with problems.",
          "love": "Restlessness in relationships or avoiding necessary relationship rest. You may be pushing too hard in love.",
          "career": "Work burnout or avoiding necessary career breaks. You may be pushing yourself too hard professionally.",
          "health": "Mental exhaustion or avoiding necessary rest. You may be ignoring your body's need for recovery.",
          "spirituality": "Spiritual restlessness or avoiding necessary spiritual rest. You may be pushing too hard in spiritual practice."
        }
      },
      "symbolism": [
        "resting figure (mental peace)",
        "three swords above (suspended thoughts)",
        "one sword below (grounded awareness)",
        "stained glass window (spiritual protection)",
        "tomb-like setting (deep rest)"
      ],
      "astrology": "Jupiter in Libra",
      "numerology": "4 - stability, foundation, rest, contemplation",
      "description": "A figure lies in peaceful rest with three swords suspended above and one below, in a sacred space with stained glass, representing mental peace and recovery."
    },
    {
      "id": "five_of_swords",
      "name": "Five of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 5,
      "element": "air",
      "keywords": {
        "upright": [
          "conflict",
          "defeat",
          "winning at all costs",
          "betrayal",
          "dishonor"
        ],
        "reversed": [
          "reconciliation",
          "making amends",
          "learning from defeat",
          "moving on",
          "forgiveness"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Five of Swords represents conflict, defeat, and winning at all costs. Victory may come with a heavy price and damaged relationships.",
          "love": "Relationship conflict, arguments, or winning fights at the cost of love. You may be prioritizing being right over being happy.",
          "career": "Workplace conflict, office politics, or achieving success through questionable means. Victory may come at the cost of relationships.",
          "health": "Conflict affecting health, stress from arguments, or defeating illness through aggressive treatment. The cure may be harsh.",
          "spirituality": "Spiritual conflict, defeating others in spiritual debates, or winning arguments at the cost of spiritual growth."
        },
        "reversed": {
          "general": "Reconciliation, making amends, and learning from conflict. You're ready to move past disputes and heal relationships.",
          "love": "Reconciliation after relationship conflict, making amends, and choosing love over being right. Healing damaged relationships.",
          "career": "Workplace reconciliation, learning from professional conflicts, and choosing collaboration over competition.",
          "health": "Recovery from health conflicts, making peace with illness, and choosing healing over fighting.",
          "spirituality": "Spiritual reconciliation, making amends for spiritual conflicts, and choosing growth over winning debates."
        }
      },
      "symbolism": [
        "victorious figure (hollow victory)",
        "three swords collected (spoils of war)",
        "two defeated figures (casualties)",
        "stormy sky (conflict)",
        "scattered swords (aftermath)"
      ],
      "astrology": "Venus in Aquarius",
      "numerology": "5 - change, challenge, conflict, learning through difficulty",
      "description": "A figure collects three swords while two defeated figures walk away under a stormy sky, representing victory that comes at a heavy cost."
    },
    {
      "id": "six_of_swords",
      "name": "Six of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 6,
      "element": "air",
      "keywords": {
        "upright": [
          "transition",
          "moving on",
          "healing",
          "travel",
          "mental shift"
        ],
        "reversed": [
          "stuck in past",
          "resistance to change",
          "unfinished business",
          "turbulent transition",
          "baggage"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Six of Swords represents transition, moving on, and healing. You're leaving behind difficulties and moving toward calmer waters.",
          "love": "Moving on from relationship difficulties, healing from past hurts, and transitioning to a better emotional state.",
          "career": "Professional transition, moving to a better job situation, and leaving behind workplace difficulties.",
          "health": "Healing and recovery, moving away from health problems, and transitioning to better wellness.",
          "spirituality": "Spiritual transition, moving away from spiritual difficulties, and healing spiritual wounds."
        },
        "reversed": {
          "general": "Stuck in the past, resistance to necessary change, or carrying too much baggage. The transition may be turbulent.",
          "love": "Stuck in past relationship patterns, resistance to moving on, or carrying emotional baggage into new relationships.",
          "career": "Resistance to necessary career changes, stuck in old professional patterns, or carrying workplace baggage.",
          "health": "Resistance to necessary health changes, stuck in unhealthy patterns, or carrying health baggage.",
          "spirituality": "Resistance to spiritual growth, stuck in old spiritual patterns, or carrying spiritual baggage."
        }
      },
      "symbolism": [
        "boat crossing water (transition)",
        "six swords (mental baggage)",
        "hooded figures (moving forward)",
        "calm water ahead (peace)",
        "choppy water behind (difficulties left)"
      ],
      "astrology": "Mercury in Aquarius",
      "numerology": "6 - harmony, responsibility, service, healing",
      "description": "Hooded figures cross calm water in a boat carrying six swords, moving from choppy waters toward peaceful shores, representing healing transition."
    },
    {
      "id": "seven_of_swords",
      "name": "Seven of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 7,
      "element": "air",
      "keywords": {
        "upright": [
          "deception",
          "strategy",
          "stealth",
          "getting away with something",
          "cunning"
        ],
        "reversed": [
          "confession",
          "honesty",
          "returning stolen goods",
          "coming clean",
          "accountability"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Seven of Swords represents deception, strategy, and getting away with something. You may be using cunning or stealth to achieve your goals.",
          "love": "Deception or secrets in relationships. Someone may not be completely honest about their feelings or intentions.",
          "career": "Workplace deception, office politics, or using cunning strategies to get ahead. You may need to be strategic about your approach.",
          "health": "Hidden health issues or deceptive health practices. You may be avoiding the truth about your health or using questionable methods.",
          "spirituality": "Spiritual deception or avoiding spiritual truths. You may be deceiving yourself about your spiritual progress or avoiding accountability."
        },
        "reversed": {
          "general": "Coming clean, confession, and taking accountability. You're ready to be honest and return what was taken or admit wrongdoing.",
          "love": "Honesty in relationships, confessing feelings, or coming clean about deceptions. You're ready to be truthful with your partner.",
          "career": "Professional honesty, confessing workplace mistakes, or taking accountability for actions. You're ready to come clean at work.",
          "health": "Honesty about health issues, confessing unhealthy habits, or taking accountability for health choices. You're ready to face health truths.",
          "spirituality": "Spiritual honesty, confessing spiritual shortcomings, or taking accountability for spiritual actions. You're ready to be truthful about your spiritual journey."
        }
      },
      "symbolism": [
        "sneaking figure (stealth)",
        "five swords stolen (deception)",
        "two swords left behind (partial truth)",
        "military camp (strategy)",
        "tiptoeing (careful movement)"
      ],
      "astrology": "Moon in Aquarius",
      "numerology": "7 - spiritual awakening, inner wisdom, hidden knowledge",
      "description": "A figure sneaks away from a military camp carrying five swords while leaving two behind, representing strategic deception and cunning."
    },
    {
      "id": "eight_of_swords",
      "name": "Eight of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 8,
      "element": "air",
      "keywords": {
        "upright": [
          "trapped",
          "restricted",
          "self-imposed limitations",
          "victim mentality",
          "powerlessness"
        ],
        "reversed": [
          "freedom",
          "liberation",
          "self-empowerment",
          "breaking free",
          "new perspective"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Eight of Swords represents feeling trapped, restricted, or powerless. Often these limitations are self-imposed and you have more options than you realize.",
          "love": "Feeling trapped in relationships or restricted by relationship circumstances. You may feel powerless to change your romantic situation.",
          "career": "Feeling trapped in your job or restricted by professional circumstances. You may feel powerless to change your career situation.",
          "health": "Feeling trapped by health issues or restricted by physical limitations. You may feel powerless to improve your health.",
          "spirituality": "Feeling trapped by spiritual beliefs or restricted by spiritual circumstances. You may feel powerless to grow spiritually."
        },
        "reversed": {
          "general": "Breaking free from limitations, gaining new perspective, and reclaiming your power. You're realizing you have more options than you thought.",
          "love": "Breaking free from relationship restrictions, gaining new perspective on love, and reclaiming romantic power. You're seeing new possibilities.",
          "career": "Breaking free from professional limitations, gaining new career perspective, and reclaiming professional power. You're seeing new opportunities.",
          "health": "Breaking free from health limitations, gaining new perspective on wellness, and reclaiming health power. You're finding new solutions.",
          "spirituality": "Breaking free from spiritual limitations, gaining new spiritual perspective, and reclaiming spiritual power. You're finding new paths."
        }
      },
      "symbolism": [
        "blindfolded figure (limited vision)",
        "eight swords (mental barriers)",
        "bound hands (self-imposed restrictions)",
        "castle in distance (freedom available)",
        "muddy ground (unclear thinking)"
      ],
      "astrology": "Jupiter in Gemini",
      "numerology": "8 - material mastery, inner strength, breaking limitations",
      "description": "A blindfolded and bound figure stands surrounded by eight swords with a castle visible in the distance, representing self-imposed limitations and available freedom."
    },
    {
      "id": "nine_of_swords",
      "name": "Nine of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 9,
      "element": "air",
      "keywords": {
        "upright": [
          "anxiety",
          "worry",
          "nightmares",
          "mental anguish",
          "despair"
        ],
        "reversed": [
          "recovery",
          "hope",
          "healing from trauma",
          "seeking help",
          "inner peace"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Nine of Swords represents anxiety, worry, and mental anguish. You're experiencing sleepless nights and overwhelming fears, often worse than reality.",
          "love": "Relationship anxiety, worry about love, or mental anguish over romantic situations. You may be overthinking relationship problems.",
          "career": "Work-related anxiety, worry about professional future, or mental stress from career pressures. You may be catastrophizing work situations.",
          "health": "Health anxiety, worry about physical symptoms, or mental anguish affecting physical wellbeing. Stress may be impacting your health.",
          "spirituality": "Spiritual anxiety, worry about spiritual progress, or mental anguish over spiritual matters. You may be experiencing a dark night of the soul."
        },
        "reversed": {
          "general": "Recovery from anxiety, finding hope, and healing from mental anguish. You're seeking help and beginning to find inner peace.",
          "love": "Recovery from relationship anxiety, finding hope in love, and healing from romantic trauma. You're seeking support for relationship issues.",
          "career": "Recovery from work anxiety, finding hope in career, and healing from professional stress. You're seeking help for work-related mental health.",
          "health": "Recovery from health anxiety, finding hope for wellness, and healing from health-related mental anguish. You're seeking professional help.",
          "spirituality": "Recovery from spiritual anxiety, finding hope in spirituality, and healing from spiritual trauma. You're seeking spiritual guidance and support."
        }
      },
      "symbolism": [
        "figure in bed (sleepless nights)",
        "hands covering face (despair)",
        "nine swords above (overwhelming thoughts)",
        "dark room (mental darkness)",
        "carved scenes (traumatic memories)"
      ],
      "astrology": "Mars in Gemini",
      "numerology": "9 - completion, wisdom, spiritual awareness, mental culmination",
      "description": "A figure sits up in bed with hands covering their face while nine swords hang above, representing overwhelming anxiety and mental anguish."
    },
    {
      "id": "ten_of_swords",
      "name": "Ten of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 10,
      "element": "air",
      "keywords": {
        "upright": [
          "rock bottom",
          "painful endings",
          "betrayal",
          "crisis",
          "transformation"
        ],
        "reversed": [
          "recovery",
          "regeneration",
          "resisting endings",
          "learning from pain",
          "gradual healing"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ten of Swords represents rock bottom, painful endings, and crisis. Though this is the darkest hour, it also marks the end of suffering and beginning of recovery.",
          "love": "Painful relationship ending, betrayal, or emotional rock bottom. Though devastating, this marks the end of suffering and beginning of healing.",
          "career": "Professional crisis, job loss, or career rock bottom. Though painful, this marks the end of a difficult period and beginning of renewal.",
          "health": "Health crisis or hitting rock bottom with health issues. Though serious, this marks the turning point toward recovery.",
          "spirituality": "Spiritual crisis or dark night of the soul. Though painful, this marks the end of spiritual suffering and beginning of renewal."
        },
        "reversed": {
          "general": "Recovery from crisis, gradual healing, and learning from painful experiences. You're beginning to rise from rock bottom.",
          "love": "Recovery from relationship trauma, gradual emotional healing, and learning from painful love experiences.",
          "career": "Recovery from professional crisis, gradual career healing, and learning from workplace trauma.",
          "health": "Recovery from health crisis, gradual physical healing, and learning from health challenges.",
          "spirituality": "Recovery from spiritual crisis, gradual spiritual healing, and learning from spiritual trauma."
        }
      },
      "symbolism": [
        "figure with ten swords (complete defeat)",
        "dawn breaking (new beginning)",
        "calm water (peace after storm)",
        "mountains (challenges overcome)",
        "red cloak (life force remaining)"
      ],
      "astrology": "Sun in Gemini",
      "numerology": "10 - completion, fulfillment, new cycle beginning, rock bottom",
      "description": "A figure lies face down with ten swords in their back as dawn breaks over calm water, representing the end of suffering and beginning of renewal."
    },
    {
      "id": "page_of_swords",
      "name": "Page of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 11,
      "element": "air",
      "keywords": {
        "upright": [
          "curiosity",
          "mental energy",
          "new ideas",
          "communication",
          "vigilance"
        ],
        "reversed": [
          "haste",
          "unfocused energy",
          "all talk no action",
          "lack of planning",
          "scattered thoughts"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Page of Swords represents curiosity, mental energy, and new ideas. You're eager to learn, communicate, and explore new intellectual territories.",
          "love": "Curious about love, mental connection with partners, and communicating feelings. You may be exploring new ways to express affection.",
          "career": "New ideas at work, eager to learn professionally, and improved communication skills. You're mentally energized about career growth.",
          "health": "Mental energy affecting health, curiosity about wellness approaches, and communicating health needs. You're exploring new health information.",
          "spirituality": "Spiritual curiosity, mental exploration of beliefs, and communicating spiritual insights. You're eager to learn about spiritual matters."
        },
        "reversed": {
          "general": "Mental haste, unfocused energy, or all talk with no action. You may be scattered in your thinking or lacking follow-through.",
          "love": "Hasty romantic decisions, unfocused relationship energy, or talking about love without action. You may be scattered in romantic pursuits.",
          "career": "Professional haste, unfocused work energy, or talking about career goals without action. You may be scattered in professional pursuits.",
          "health": "Hasty health decisions, unfocused wellness energy, or talking about health without action. You may be scattered in health approaches.",
          "spirituality": "Spiritual haste, unfocused spiritual energy, or talking about spirituality without practice. You may be scattered in spiritual pursuits."
        }
      },
      "symbolism": [
        "young figure with sword (mental readiness)",
        "windswept hair (mental energy)",
        "clouds (thoughts and ideas)",
        "birds (communication)",
        "alert posture (vigilance)"
      ],
      "astrology": "Earth of Air",
      "numerology": "Page - messenger, student, new mental beginnings",
      "description": "A young figure stands alert with a raised sword against a backdrop of windswept clouds and flying birds, representing mental energy and curiosity."
    },
    {
      "id": "knight_of_swords",
      "name": "Knight of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 12,
      "element": "air",
      "keywords": {
        "upright": [
          "ambition",
          "driven",
          "fast thinking",
          "impatience",
          "direct action"
        ],
        "reversed": [
          "reckless",
          "unfocused",
          "impulsive",
          "aggressive",
          "lack of direction"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Knight of Swords represents ambition, driven energy, and fast thinking. You're moving quickly toward your goals with determination and focus.",
          "love": "Ambitious pursuit of love, driven romantic energy, and fast-moving relationships. You're direct and determined in romantic matters.",
          "career": "Professional ambition, driven work energy, and fast career progress. You're moving quickly toward professional goals with determination.",
          "health": "Driven approach to health, fast-acting treatments, and ambitious wellness goals. You're determined to improve your health quickly.",
          "spirituality": "Ambitious spiritual pursuit, driven spiritual energy, and fast spiritual progress. You're determined to advance spiritually."
        },
        "reversed": {
          "general": "Reckless behavior, unfocused energy, or impulsive actions. You may be moving too fast without proper planning or consideration.",
          "love": "Reckless romantic behavior, unfocused relationship energy, or impulsive love decisions. You may be rushing into relationships.",
          "career": "Reckless professional behavior, unfocused work energy, or impulsive career decisions. You may be rushing professional choices.",
          "health": "Reckless health behavior, unfocused wellness energy, or impulsive health decisions. You may be rushing health choices.",
          "spirituality": "Reckless spiritual behavior, unfocused spiritual energy, or impulsive spiritual decisions. You may be rushing spiritual development."
        }
      },
      "symbolism": [
        "charging horse (swift action)",
        "raised sword (mental determination)",
        "windswept landscape (mental energy)",
        "armor (protection)",
        "focused expression (determination)"
      ],
      "astrology": "Fire of Air",
      "numerology": "Knight - action, movement, mental quest",
      "description": "A knight charges forward on a galloping horse with sword raised, against a windswept landscape, representing swift mental action and determination."
    },
    {
      "id": "queen_of_swords",
      "name": "Queen of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 13,
      "element": "air",
      "keywords": {
        "upright": [
          "independence",
          "clear thinking",
          "direct communication",
          "intellectual",
          "perceptive"
        ],
        "reversed": [
          "cold",
          "harsh",
          "bitter",
          "cruel",
          "unforgiving"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Queen of Swords represents independence, clear thinking, and direct communication. You're intellectually sharp, perceptive, and able to see through deception.",
          "love": "Independent approach to love, clear communication in relationships, and intellectual connection with partners. You value honesty and directness.",
          "career": "Professional independence, clear thinking at work, and direct communication with colleagues. You're intellectually sharp in business matters.",
          "health": "Independent approach to health, clear thinking about wellness, and direct communication with healthcare providers. You're perceptive about health needs.",
          "spirituality": "Independent spiritual path, clear spiritual thinking, and direct spiritual communication. You're intellectually approaching spirituality."
        },
        "reversed": {
          "general": "Coldness, harshness, or bitterness. You may be too critical, unforgiving, or using your intellect to hurt rather than help.",
          "love": "Cold or harsh behavior in relationships, bitter about past love, or being overly critical of partners. You may be unforgiving.",
          "career": "Cold or harsh professional behavior, bitter about work situations, or being overly critical of colleagues. You may be unforgiving at work.",
          "health": "Cold or harsh approach to health, bitter about health issues, or being overly critical of health providers. You may be unforgiving about health setbacks.",
          "spirituality": "Cold or harsh spiritual approach, bitter about spiritual experiences, or being overly critical of spiritual teachers. You may be spiritually unforgiving."
        }
      },
      "symbolism": [
        "upright sword (clear judgment)",
        "stern expression (directness)",
        "clouds (mental clarity)",
        "butterfly (transformation)",
        "throne (authority)"
      ],
      "astrology": "Water of Air",
      "numerology": "Queen - nurturing, intuitive, mature feminine intellectual wisdom",
      "description": "A stern queen sits on her throne holding an upright sword, with clouds and a butterfly nearby, representing intellectual authority and clear judgment."
    },
    {
      "id": "king_of_swords",
      "name": "King of Swords",
      "arcana": "minor",
      "suit": "swords",
      "number": 14,
      "element": "air",
      "keywords": {
        "upright": [
          "intellectual power",
          "authority",
          "truth",
          "clear communication",
          "mental discipline"
        ],
        "reversed": [
          "abuse of power",
          "tyranny",
          "manipulation",
          "harsh judgment",
          "lack of compassion"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The King of Swords represents intellectual power, authority, and truth. You're a master of clear thinking, fair judgment, and effective communication.",
          "love": "Intellectual leadership in relationships, clear communication with partners, and fair judgment in love matters. You bring wisdom to relationships.",
          "career": "Professional authority, intellectual leadership at work, and clear business communication. You're respected for your mental discipline and fair judgment.",
          "health": "Intellectual approach to health, clear communication with healthcare providers, and disciplined health management. You make wise health decisions.",
          "spirituality": "Spiritual authority, intellectual approach to spirituality, and clear spiritual communication. You're a wise spiritual teacher or leader."
        },
        "reversed": {
          "general": "Abuse of intellectual power, tyrannical behavior, or manipulation through superior knowledge. You may be using your intellect to dominate others.",
          "love": "Intellectual manipulation in relationships, tyrannical behavior with partners, or harsh judgment in love. You may be emotionally cold.",
          "career": "Abuse of professional authority, workplace tyranny, or manipulation of colleagues. You may be using your position to dominate others.",
          "health": "Abuse of health authority, tyrannical approach to wellness, or manipulation of health information. You may be ignoring emotional health needs.",
          "spirituality": "Abuse of spiritual authority, spiritual tyranny, or manipulation of spiritual knowledge. You may be using spirituality to control others."
        }
      },
      "symbolism": [
        "throne (authority)",
        "upright sword (justice)",
        "stern expression (discipline)",
        "butterflies (transformation)",
        "clear sky (mental clarity)"
      ],
      "astrology": "Air of Air",
      "numerology": "King - mastery, authority, mature masculine intellectual power",
      "description": "A powerful king sits on his throne holding an upright sword, with butterflies and clear skies around him, representing intellectual mastery and just authority."
    },
    {
      "id": "two_of_pentacles",
      "name": "Two of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 2,
      "element": "earth",
      "keywords": {
        "upright": [
          "balance",
          "juggling priorities",
          "multitasking",
          "adaptability",
          "time management"
        ],
        "reversed": [
          "overwhelmed",
          "disorganization",
          "poor time management",
          "dropping the ball",
          "imbalance"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Two of Pentacles represents balance, juggling multiple priorities, and adaptability. You're managing various responsibilities with skill and flexibility.",
          "love": "Balancing relationship needs with other life priorities. You're juggling romance with work, family, or other commitments successfully.",
          "career": "Managing multiple projects or responsibilities at work. You're successfully juggling various professional priorities and adapting to changes.",
          "health": "Balancing different aspects of health and wellness. You're successfully managing various health routines and adapting to changing needs.",
          "spirituality": "Balancing spiritual practice with daily life. You're successfully integrating spirituality with practical responsibilities."
        },
        "reversed": {
          "general": "Feeling overwhelmed by too many responsibilities, poor time management, or dropping important priorities. You may need to simplify.",
          "love": "Struggling to balance relationship needs with other priorities. You may be neglecting your partner or feeling overwhelmed by relationship demands.",
          "career": "Overwhelmed by work responsibilities, poor project management, or dropping important professional priorities. You may need better organization.",
          "health": "Struggling to balance health needs with other priorities. You may be neglecting wellness or feeling overwhelmed by health routines.",
          "spirituality": "Struggling to balance spiritual practice with daily life. You may be neglecting spirituality or feeling overwhelmed by spiritual commitments."
        }
      },
      "symbolism": [
        "juggling figure (balance)",
        "two pentacles (dual priorities)",
        "infinity symbol (endless cycle)",
        "ships on waves (navigating change)",
        "dancing motion (adaptability)"
      ],
      "astrology": "Jupiter in Capricorn",
      "numerology": "2 - duality, balance, cooperation, choice",
      "description": "A figure dances while juggling two pentacles connected by an infinity symbol, with ships navigating waves in the background, representing skillful balance of priorities."
    },
    {
      "id": "three_of_pentacles",
      "name": "Three of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 3,
      "element": "earth",
      "keywords": {
        "upright": [
          "teamwork",
          "collaboration",
          "building",
          "implementation",
          "shared goals"
        ],
        "reversed": [
          "lack of teamwork",
          "disorganization",
          "group conflict",
          "lack of commitment",
          "poor planning"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Three of Pentacles represents teamwork, collaboration, and building something together. You're working with others to create something meaningful and lasting.",
          "love": "Collaborative relationships, building a future together, and working as a team with your partner. You're creating something beautiful together.",
          "career": "Successful teamwork, collaborative projects, and building professional relationships. You're working well with colleagues to achieve shared goals.",
          "health": "Collaborative approach to health, working with healthcare providers, and building healthy habits with support from others.",
          "spirituality": "Spiritual collaboration, working with spiritual community, and building spiritual practices with others. You're growing spiritually through group work."
        },
        "reversed": {
          "general": "Lack of teamwork, disorganization, or group conflict. You may be struggling to work effectively with others or lacking commitment to shared goals.",
          "love": "Relationship conflicts, lack of collaboration with partner, or difficulty building a future together. You may not be working as a team.",
          "career": "Workplace conflicts, poor teamwork, or disorganized projects. You may be struggling to collaborate effectively with colleagues.",
          "health": "Lack of support for health goals, conflicts with healthcare providers, or disorganized approach to wellness. You may need better health teamwork.",
          "spirituality": "Spiritual conflicts, lack of spiritual community support, or disorganized spiritual practice. You may be struggling with spiritual teamwork."
        }
      },
      "symbolism": [
        "three figures working (collaboration)",
        "cathedral setting (building something sacred)",
        "architectural plans (careful planning)",
        "different skills (diverse talents)",
        "shared vision (common goals)"
      ],
      "astrology": "Mars in Capricorn",
      "numerology": "3 - creativity, expression, growth, collaboration",
      "description": "Three figures work together in a cathedral, with one holding architectural plans while others contribute their skills, representing collaborative creation."
    },
    {
      "id": "four_of_pentacles",
      "name": "Four of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 4,
      "element": "earth",
      "keywords": {
        "upright": [
          "security",
          "control",
          "conservation",
          "frugality",
          "possessiveness"
        ],
        "reversed": [
          "generosity",
          "sharing",
          "openness",
          "letting go",
          "financial freedom"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Four of Pentacles represents security, control, and holding onto what you have. You may be focused on financial stability but risk becoming possessive or stingy.",
          "love": "Possessiveness in relationships, holding onto past hurts, or being emotionally guarded. You may be afraid to open your heart fully.",
          "career": "Financial security at work, conservative approach to money, or holding onto resources tightly. You may be resistant to financial risks.",
          "health": "Conservative approach to health, holding onto old health habits, or being resistant to new treatments. You may be overly cautious.",
          "spirituality": "Spiritual conservatism, holding onto old beliefs, or being resistant to spiritual growth. You may be afraid to let go of familiar practices."
        },
        "reversed": {
          "general": "Generosity, sharing resources, and letting go of excessive control. You're becoming more open and willing to take calculated risks.",
          "love": "Emotional generosity, sharing feelings openly, and letting go of relationship fears. You're opening your heart to love.",
          "career": "Financial generosity, sharing resources at work, and taking calculated professional risks. You're becoming more open to opportunities.",
          "health": "Openness to new health approaches, sharing health knowledge, and letting go of health fears. You're willing to try new treatments.",
          "spirituality": "Spiritual generosity, sharing spiritual knowledge, and letting go of spiritual fears. You're open to new spiritual experiences."
        }
      },
      "symbolism": [
        "figure holding pentacle (control)",
        "pentacles on head and feet (security)",
        "city in background (material world)",
        "closed posture (defensiveness)",
        "crown (material authority)"
      ],
      "astrology": "Sun in Capricorn",
      "numerology": "4 - stability, foundation, security, control",
      "description": "A figure sits holding a pentacle tightly while pentacles rest on their head and feet, with a city behind, representing material security and control."
    },
    {
      "id": "five_of_pentacles",
      "name": "Five of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 5,
      "element": "earth",
      "keywords": {
        "upright": [
          "hardship",
          "financial loss",
          "poverty",
          "isolation",
          "spiritual poverty"
        ],
        "reversed": [
          "recovery",
          "charity",
          "improvement",
          "forgiveness",
          "spiritual wealth"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Five of Pentacles represents hardship, financial loss, and feeling left out in the cold. You may be experiencing material or spiritual poverty.",
          "love": "Relationship hardship, feeling emotionally impoverished, or isolation in love. You may feel left out or unsupported by your partner.",
          "career": "Financial difficulties, job loss, or professional hardship. You may be struggling financially or feeling professionally isolated.",
          "health": "Health challenges, feeling physically depleted, or lack of resources for healthcare. You may be struggling with health-related financial issues.",
          "spirituality": "Spiritual poverty, feeling disconnected from divine support, or spiritual isolation. You may feel abandoned by your spiritual community."
        },
        "reversed": {
          "general": "Recovery from hardship, receiving help or charity, and improvement in circumstances. You're beginning to see light at the end of the tunnel.",
          "love": "Recovery from relationship hardship, receiving emotional support, and improvement in love life. You're finding help and healing.",
          "career": "Recovery from financial difficulties, receiving professional help, and improvement in work situation. You're finding new opportunities.",
          "health": "Recovery from health challenges, receiving medical help, and improvement in physical condition. You're finding the support you need.",
          "spirituality": "Recovery from spiritual poverty, receiving spiritual guidance, and improvement in spiritual connection. You're finding spiritual community and support."
        }
      },
      "symbolism": [
        "two figures in snow (hardship)",
        "church window (available help)",
        "crutches (physical challenges)",
        "tattered clothes (poverty)",
        "five pentacles above (spiritual resources)"
      ],
      "astrology": "Mercury in Taurus",
      "numerology": "5 - change, challenge, learning through difficulty",
      "description": "Two figures struggle through snow past a lit church window, representing hardship and the availability of help if one seeks it."
    },
    {
      "id": "six_of_pentacles",
      "name": "Six of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 6,
      "element": "earth",
      "keywords": {
        "upright": [
          "generosity",
          "charity",
          "sharing",
          "fairness",
          "community"
        ],
        "reversed": [
          "selfishness",
          "debt",
          "one-sided charity",
          "strings attached",
          "inequality"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Six of Pentacles represents generosity, charity, and fair exchange. You're either giving or receiving help, creating balance through sharing resources.",
          "love": "Generous love, giving and receiving equally in relationships, and sharing emotional resources. You're creating balance in love.",
          "career": "Professional generosity, fair compensation, and sharing resources at work. You're creating equitable exchanges in your career.",
          "health": "Sharing health knowledge, receiving or giving health support, and creating balance in wellness. You're part of a supportive health community.",
          "spirituality": "Spiritual generosity, sharing spiritual knowledge, and creating balance in spiritual community. You're giving and receiving spiritual support."
        },
        "reversed": {
          "general": "Selfishness, unfair exchanges, or charity with strings attached. You may be giving or receiving help with ulterior motives.",
          "love": "Selfish behavior in relationships, unfair emotional exchanges, or love with conditions. You may be keeping score in love.",
          "career": "Workplace selfishness, unfair compensation, or professional help with strings attached. You may be experiencing inequality at work.",
          "health": "Selfish health behavior, unfair access to healthcare, or health support with conditions. You may be experiencing health inequality.",
          "spirituality": "Spiritual selfishness, unfair spiritual exchanges, or spiritual help with strings attached. You may be experiencing spiritual inequality."
        }
      },
      "symbolism": [
        "merchant with scales (fair exchange)",
        "giving coins (generosity)",
        "beggars receiving (charity)",
        "balanced scales (fairness)",
        "community setting (sharing)"
      ],
      "astrology": "Moon in Taurus",
      "numerology": "6 - harmony, responsibility, service, balance",
      "description": "A merchant holds scales while giving coins to beggars, representing fair exchange, generosity, and the balance of giving and receiving."
    },
    {
      "id": "seven_of_pentacles",
      "name": "Seven of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 7,
      "element": "earth",
      "keywords": {
        "upright": [
          "assessment",
          "hard work",
          "perseverance",
          "investment",
          "long-term view"
        ],
        "reversed": [
          "lack of reward",
          "impatience",
          "poor investment",
          "lack of growth",
          "giving up"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Seven of Pentacles represents assessment, hard work, and taking a long-term view. You're evaluating your progress and considering future investments.",
          "love": "Assessing relationship progress, investing in long-term love, and taking time to evaluate romantic growth. You're considering the future of your relationship.",
          "career": "Evaluating career progress, investing in professional development, and taking a long-term view of success. You're assessing your work investments.",
          "health": "Assessing health progress, investing in long-term wellness, and evaluating health improvements. You're taking a patient approach to health.",
          "spirituality": "Assessing spiritual progress, investing in long-term spiritual growth, and evaluating spiritual development. You're taking a patient approach to spirituality."
        },
        "reversed": {
          "general": "Lack of reward for efforts, impatience with progress, or poor investments. You may be giving up too soon or not seeing results.",
          "love": "Impatience with relationship progress, lack of romantic reward, or poor emotional investments. You may be giving up on love too soon.",
          "career": "Impatience with career progress, lack of professional reward, or poor work investments. You may be giving up on goals too soon.",
          "health": "Impatience with health progress, lack of wellness reward, or poor health investments. You may be giving up on health goals too soon.",
          "spirituality": "Impatience with spiritual progress, lack of spiritual reward, or poor spiritual investments. You may be giving up on spiritual growth too soon."
        }
      },
      "symbolism": [
        "farmer with hoe (hard work)",
        "growing pentacles (investment)",
        "contemplative pose (assessment)",
        "garden setting (cultivation)",
        "patience (long-term view)"
      ],
      "astrology": "Saturn in Taurus",
      "numerology": "7 - spiritual awakening, inner wisdom, assessment",
      "description": "A farmer leans on his hoe, contemplating seven pentacles growing on a vine, representing the assessment of hard work and long-term investment."
    },
    {
      "id": "eight_of_pentacles",
      "name": "Eight of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 8,
      "element": "earth",
      "keywords": {
        "upright": [
          "skill development",
          "craftsmanship",
          "dedication",
          "quality work",
          "mastery"
        ],
        "reversed": [
          "lack of focus",
          "perfectionism",
          "mediocrity",
          "lack of skill",
          "shortcuts"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Eight of Pentacles represents skill development, craftsmanship, and dedication to quality work. You're focused on mastering your craft through diligent practice.",
          "love": "Dedicating effort to improve relationships, developing emotional skills, and working on love with craftsmanship. You're mastering the art of love.",
          "career": "Skill development at work, dedication to professional craftsmanship, and focusing on quality. You're mastering your professional skills.",
          "health": "Dedicating effort to health improvement, developing wellness skills, and focusing on quality self-care. You're mastering healthy habits.",
          "spirituality": "Dedicating effort to spiritual development, developing spiritual skills, and focusing on quality practice. You're mastering spiritual disciplines."
        },
        "reversed": {
          "general": "Lack of focus, perfectionism, or taking shortcuts. You may be producing mediocre work or obsessing over minor details.",
          "love": "Lack of focus in relationships, perfectionism in love, or taking emotional shortcuts. You may be producing mediocre emotional connections.",
          "career": "Lack of professional focus, workplace perfectionism, or taking career shortcuts. You may be producing mediocre work quality.",
          "health": "Lack of health focus, perfectionism in wellness, or taking health shortcuts. You may be producing mediocre health results.",
          "spirituality": "Lack of spiritual focus, perfectionism in practice, or taking spiritual shortcuts. You may be producing mediocre spiritual growth."
        }
      },
      "symbolism": [
        "craftsman at work (skill development)",
        "eight pentacles (mastery)",
        "tools and bench (craftsmanship)",
        "focused concentration (dedication)",
        "quality work (excellence)"
      ],
      "astrology": "Sun in Virgo",
      "numerology": "8 - material mastery, inner strength, skill development",
      "description": "A skilled craftsman sits at his bench, carefully carving pentacles with focused dedication, representing the mastery of skills through diligent practice."
    },
    {
      "id": "nine_of_pentacles",
      "name": "Nine of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 9,
      "element": "earth",
      "keywords": {
        "upright": [
          "independence",
          "luxury",
          "self-sufficiency",
          "financial freedom",
          "accomplishment"
        ],
        "reversed": [
          "financial dependence",
          "lack of self-discipline",
          "overspending",
          "isolation",
          "superficial success"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Nine of Pentacles represents independence, luxury, and self-sufficiency. You've achieved financial freedom and can enjoy the fruits of your labor.",
          "love": "Independence in relationships, self-sufficient love, and enjoying romantic luxury. You're complete within yourself and can offer love from abundance.",
          "career": "Professional independence, financial success, and career accomplishment. You've achieved self-sufficiency through your work.",
          "health": "Health independence, self-sufficient wellness, and enjoying physical luxury. You've achieved health freedom through your efforts.",
          "spirituality": "Spiritual independence, self-sufficient practice, and enjoying spiritual luxury. You've achieved spiritual freedom through your dedication."
        },
        "reversed": {
          "general": "Financial dependence, lack of self-discipline, or superficial success. You may be overspending or relying too much on others.",
          "love": "Emotional dependence, lack of self-love, or superficial romantic success. You may be relying too much on others for happiness.",
          "career": "Professional dependence, lack of work discipline, or superficial career success. You may be relying too much on others for advancement.",
          "health": "Health dependence, lack of wellness discipline, or superficial health success. You may be relying too much on others for wellbeing.",
          "spirituality": "Spiritual dependence, lack of spiritual discipline, or superficial spiritual success. You may be relying too much on others for spiritual growth."
        }
      },
      "symbolism": [
        "elegant woman (independence)",
        "luxury garden (abundance)",
        "falcon (mastery)",
        "nine pentacles (material success)",
        "fine clothing (prosperity)"
      ],
      "astrology": "Venus in Virgo",
      "numerology": "9 - completion, wisdom, spiritual awareness, independence",
      "description": "An elegant woman stands in a luxury garden with a falcon, surrounded by nine pentacles, representing independence and the enjoyment of material success."
    },
    {
      "id": "ten_of_pentacles",
      "name": "Ten of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 10,
      "element": "earth",
      "keywords": {
        "upright": [
          "wealth",
          "financial security",
          "family legacy",
          "inheritance",
          "long-term success"
        ],
        "reversed": [
          "financial failure",
          "family disputes",
          "lack of stability",
          "short-term thinking",
          "broken traditions"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Ten of Pentacles represents wealth, financial security, and family legacy. You've achieved long-term success and created lasting abundance for future generations.",
          "love": "Long-term relationship stability, family harmony, and building a secure future together. You're creating a lasting legacy of love.",
          "career": "Financial success, career achievement, and building long-term professional security. You're creating wealth and stability for the future.",
          "health": "Long-term health and wellness, family health traditions, and creating healthy legacies. You're building sustainable health practices.",
          "spirituality": "Spiritual abundance, family spiritual traditions, and creating lasting spiritual legacies. You're building generational spiritual wealth."
        },
        "reversed": {
          "general": "Financial instability, family disputes over money, or failure to build lasting security. Short-term thinking may be undermining long-term success.",
          "love": "Relationship instability, family conflicts, or failure to build lasting love. Financial stress may be affecting relationships.",
          "career": "Career instability, financial setbacks, or failure to build lasting professional success. Short-term thinking may be limiting growth.",
          "health": "Health instability, family health issues, or failure to build lasting wellness. Poor health choices may be affecting long-term wellbeing.",
          "spirituality": "Spiritual instability, family spiritual conflicts, or failure to build lasting spiritual practices. Materialism may be undermining spiritual growth."
        }
      },
      "symbolism": [
        "wealthy family (generational success)",
        "ten pentacles (complete abundance)",
        "archway (family legacy)",
        "dogs (loyalty and protection)",
        "coat of arms (family heritage)"
      ],
      "astrology": "Mercury in Virgo",
      "numerology": "10 - completion, fulfillment, new cycle beginning, material mastery",
      "description": "A wealthy family gathers under an archway decorated with ten pentacles and a coat of arms, with loyal dogs nearby, representing generational wealth and family legacy."
    },
    {
      "id": "page_of_pentacles",
      "name": "Page of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 11,
      "element": "earth",
      "keywords": {
        "upright": [
          "manifestation",
          "financial opportunity",
          "skill development",
          "studiousness",
          "new venture"
        ],
        "reversed": [
          "lack of progress",
          "procrastination",
          "lack of goals",
          "bad investment",
          "missed opportunity"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Page of Pentacles represents manifestation, new financial opportunities, and skill development. You're ready to turn ideas into reality through practical action.",
          "love": "New romantic opportunities, manifesting love goals, and developing relationship skills. You're ready to build something real in love.",
          "career": "New career opportunities, professional skill development, and manifesting work goals. You're ready to build your professional future.",
          "health": "New health opportunities, developing wellness skills, and manifesting health goals. You're ready to build better health habits.",
          "spirituality": "New spiritual opportunities, developing spiritual skills, and manifesting spiritual goals. You're ready to build a practical spiritual practice."
        },
        "reversed": {
          "general": "Lack of progress, procrastination, or missed opportunities. You may be struggling to turn ideas into reality or lacking clear goals.",
          "love": "Missed romantic opportunities, procrastination in love, or lack of relationship goals. You may be struggling to manifest love.",
          "career": "Missed career opportunities, professional procrastination, or lack of work goals. You may be struggling to manifest career success.",
          "health": "Missed health opportunities, wellness procrastination, or lack of health goals. You may be struggling to manifest better health.",
          "spirituality": "Missed spiritual opportunities, spiritual procrastination, or lack of spiritual goals. You may be struggling to manifest spiritual growth."
        }
      },
      "symbolism": [
        "young figure with pentacle (new opportunity)",
        "fertile landscape (potential)",
        "mountains (goals to achieve)",
        "studious expression (learning)",
        "practical clothing (earthiness)"
      ],
      "astrology": "Earth of Earth",
      "numerology": "Page - messenger, student, new material beginnings",
      "description": "A young figure stands in a fertile landscape, holding a pentacle and gazing at distant mountains, representing new opportunities and practical manifestation."
    },
    {
      "id": "knight_of_pentacles",
      "name": "Knight of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 12,
      "element": "earth",
      "keywords": {
        "upright": [
          "efficiency",
          "routine",
          "conservatism",
          "methodical",
          "reliability"
        ],
        "reversed": [
          "laziness",
          "obsessiveness",
          "stubbornness",
          "perfectionism",
          "boredom"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Knight of Pentacles represents efficiency, routine, and methodical progress. You're moving steadily toward your goals with reliability and determination.",
          "love": "Reliable and steady approach to love, methodical relationship building, and consistent romantic effort. You're a dependable partner.",
          "career": "Efficient and methodical work approach, reliable professional performance, and steady career progress. You're a dependable employee.",
          "health": "Methodical approach to health, reliable wellness routines, and steady health progress. You're consistent in your health efforts.",
          "spirituality": "Methodical spiritual practice, reliable spiritual routines, and steady spiritual progress. You're consistent in your spiritual efforts."
        },
        "reversed": {
          "general": "Laziness, obsessiveness, or stubbornness. You may be stuck in routines, being overly perfectionist, or lacking motivation.",
          "love": "Lazy approach to relationships, obsessive romantic behavior, or stubborn relationship patterns. You may be stuck in romantic routines.",
          "career": "Lazy work approach, obsessive professional behavior, or stubborn work patterns. You may be stuck in unproductive routines.",
          "health": "Lazy health approach, obsessive wellness behavior, or stubborn health patterns. You may be stuck in unhealthy routines.",
          "spirituality": "Lazy spiritual approach, obsessive spiritual behavior, or stubborn spiritual patterns. You may be stuck in limiting spiritual routines."
        }
      },
      "symbolism": [
        "steady horse (reliability)",
        "plowed field (methodical work)",
        "pentacle held carefully (attention to detail)",
        "patient expression (persistence)",
        "practical armor (protection)"
      ],
      "astrology": "Fire of Earth",
      "numerology": "Knight - action, movement, methodical quest",
      "description": "A knight sits steadily on his horse in a plowed field, carefully holding a pentacle, representing methodical progress and reliable determination."
    },
    {
      "id": "queen_of_pentacles",
      "name": "Queen of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 13,
      "element": "earth",
      "keywords": {
        "upright": [
          "nurturing",
          "practical",
          "providing",
          "down-to-earth",
          "resourceful"
        ],
        "reversed": [
          "financial insecurity",
          "smothering",
          "jealousy",
          "materialism",
          "self-care neglect"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The Queen of Pentacles represents nurturing, practicality, and providing for others. You're grounded, resourceful, and able to create abundance for yourself and others.",
          "love": "Nurturing and practical approach to love, providing emotional security, and creating a stable home. You're a caring and supportive partner.",
          "career": "Practical and nurturing leadership at work, providing for team needs, and creating professional abundance. You're a supportive and resourceful leader.",
          "health": "Nurturing and practical approach to health, providing for physical needs, and creating wellness abundance. You're caring for your body's needs.",
          "spirituality": "Nurturing and practical spiritual approach, providing spiritual support to others, and creating spiritual abundance. You're grounded in your spirituality."
        },
        "reversed": {
          "general": "Financial insecurity, smothering behavior, or neglecting self-care. You may be too focused on material concerns or being overly controlling.",
          "love": "Smothering romantic behavior, jealousy in relationships, or neglecting emotional self-care. You may be too controlling in love.",
          "career": "Smothering leadership style, workplace jealousy, or neglecting professional self-care. You may be too controlling at work.",
          "health": "Neglecting health self-care, smothering health behaviors, or health-related jealousy. You may be too controlling about health.",
          "spirituality": "Neglecting spiritual self-care, smothering spiritual behavior, or spiritual jealousy. You may be too controlling in spiritual matters."
        }
      },
      "symbolism": [
        "throne in garden (earthly abundance)",
        "pentacle in lap (material nurturing)",
        "rabbit (fertility)",
        "roses (beauty and love)",
        "practical clothing (down-to-earth nature)"
      ],
      "astrology": "Water of Earth",
      "numerology": "Queen - nurturing, intuitive, mature feminine material wisdom",
      "description": "A nurturing queen sits on her throne in a beautiful garden, holding a pentacle with a rabbit at her feet, representing practical abundance and care."
    },
    {
      "id": "king_of_pentacles",
      "name": "King of Pentacles",
      "arcana": "minor",
      "suit": "pentacles",
      "number": 14,
      "element": "earth",
      "keywords": {
        "upright": [
          "abundance",
          "business success",
          "leadership",
          "security",
          "discipline"
        ],
        "reversed": [
          "greed",
          "materialism",
          "financial failure",
          "stubbornness",
          "corruption"
        ]
      },
      "meanings": {
        "upright": {
          "general": "The King of Pentacles represents abundance, business success, and material leadership. You've achieved financial mastery and can provide security for others.",
          "love": "Providing security and stability in relationships, generous love, and building a solid foundation for the future. You're a reliable and prosperous partner.",
          "career": "Business success, financial leadership, and professional abundance. You've achieved mastery in your field and can provide for others.",
          "health": "Physical strength and vitality, abundant health resources, and disciplined wellness approach. You're in excellent health and can maintain it.",
          "spirituality": "Spiritual abundance, grounded spiritual leadership, and practical spiritual wisdom. You've achieved spiritual mastery through earthly experience."
        },
        "reversed": {
          "general": "Greed, materialism, or financial failure. You may be too focused on money, corrupt in business dealings, or losing financial control.",
          "love": "Materialistic approach to relationships, using money to control love, or financial stress affecting relationships. You may be too focused on material security.",
          "career": "Business corruption, financial failure, or materialistic leadership. You may be abusing your professional power or losing financial control.",
          "health": "Health issues from excess, materialistic approach to wellness, or neglecting health for money. You may be sacrificing health for wealth.",
          "spirituality": "Spiritual materialism, corrupt spiritual leadership, or losing spiritual values for material gain. You may be abusing spiritual power."
        }
      },
      "symbolism": [
        "throne with bulls (material power)",
        "pentacle in hand (financial mastery)",
        "castle (security and wealth)",
        "grapes and vines (abundance)",
        "royal robes (material authority)"
      ],
      "astrology": "Air of Earth",
      "numerology": "King - mastery, authority, mature masculine material power",
      "description": "A powerful king sits on his throne decorated with bulls, holding a pentacle, with a castle and abundant vines around him, representing material mastery and generous leadership."
    }
  ]
}